{
  "buttermilk": {
    "name": "Buttermilk",
    "category": "dairy",
    "aliases": [
      "cultured buttermilk"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "acidity": "high (pH 4.4-4.8)",
      "fat": "low (1-2%)",
      "function": "tenderizes gluten, activates baking soda, adds tangy flavor"
    },
    "substitutions": [
      {
        "name": "Plain Yogurt + Milk",
        "ratio": "3/4 cup plain yogurt + 1/4 cup milk = 1 cup buttermilk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Yogurt has similar acidity, fat content, and cultured flavor. The milk thins it to the right consistency.",
        "notes": "Use plain, unflavored yogurt. Greek yogurt works but use more milk (1/2 cup yogurt + 1/2 cup milk).",
        "science": "<p>Buttermilk and yogurt are both fermented dairy products containing lactic acid bacteria. This fermentation produces lactic acid, lowering the pH to around 4.5.</p><p>In baking, this acidity serves two critical functions: it reacts with baking soda (sodium bicarbonate) to produce CO₂ for leavening, and it denatures gluten proteins, resulting in a more tender crumb.</p><p>Yogurt's casein proteins also contribute to moisture retention during baking, keeping your final product soft longer.</p>"
      },
      {
        "name": "Sour Cream + Milk",
        "ratio": "3/4 cup sour cream + 1/4 cup milk = 1 cup buttermilk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Sour cream has the same cultured tang and similar acidity. Higher fat makes baked goods extra tender.",
        "notes": "Results may be slightly richer due to higher fat content.",
        "science": "<p>Sour cream undergoes the same lactic acid fermentation as buttermilk, giving it comparable acidity (pH 4.5). The key difference is fat content: sour cream has 18-20% fat versus buttermilk's 1-2%.</p><p>This higher fat content actually enhances tenderness because fat molecules coat flour proteins, physically preventing gluten formation. The result is an even more tender crumb than buttermilk would produce.</p>"
      },
      {
        "name": "Milk + Lemon Juice",
        "ratio": "1 cup milk + 1 tablespoon lemon juice, let sit 5-10 minutes",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "The acid curdles the milk, creating acidity. However, it lacks the complex cultured flavor.",
        "notes": "NOT recommended for baking. The acidity is inconsistent and won't reliably activate baking soda. Fine for marinades or sauces.",
        "science": "<p>Adding citric acid (lemon juice) to milk causes the casein proteins to denature and coagulate, mimicking the curdled texture of buttermilk.</p><p>However, this is purely a chemical reaction, not fermentation. Real buttermilk contains complex flavor compounds—diacetyl, acetaldehyde, and others—produced by bacterial metabolism that this quick method cannot replicate.</p><p>The acidity is also less consistent, making it unreliable for precise leavening reactions in baking. That's why it works better in cooking applications.</p>"
      },
      {
        "name": "Milk + White Vinegar",
        "ratio": "1 cup milk + 1 tablespoon white vinegar, let sit 5-10 minutes",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates acidity through curdling, similar to lemon juice method.",
        "notes": "NOT recommended for baking. Use only in cooking where exact leavening isn't critical.",
        "science": "<p>Like the lemon juice method, vinegar's acetic acid causes milk proteins to curdle. The resulting texture approximates buttermilk, but the flavor profile is quite different.</p><p>Acetic acid has a sharper, more pungent taste than lactic acid. In cooking where buttermilk provides moisture and some acidity, this works fine. For baking, the inconsistent acid levels make leavening unpredictable.</p>"
      },
      {
        "name": "Kefir",
        "ratio": "1 cup kefir = 1 cup buttermilk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Kefir is also a cultured dairy product with similar acidity, thickness, and tangy flavor.",
        "notes": "Excellent 1:1 substitute. Slightly thinner than buttermilk but same chemistry.",
        "science": "<p>Kefir is fermented using a SCOBY (symbiotic culture of bacteria and yeast), producing an even more complex acid profile than buttermilk. It contains lactic acid, acetic acid, and trace amounts of alcohol.</p><p>The pH is virtually identical to buttermilk (4.4-4.6), providing the same gluten-tenderizing and leavening-activating functions. The additional bacterial diversity actually makes it nutritionally superior while functioning identically in recipes.</p>"
      }
    ]
  },
  "eggs": {
    "name": "Eggs (Whole)",
    "category": "eggs",
    "aliases": [
      "whole eggs",
      "chicken eggs"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "binding, leavening, moisture, richness, emulsification"
    },
    "substitutions": [
      {
        "name": "Flax Egg",
        "ratio": "1 tablespoon ground flaxseed + 3 tablespoons water, rest 5 min = 1 egg",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Flaxseed becomes gelatinous when mixed with water, providing binding similar to eggs.",
        "notes": "Best for dense, moist baked goods (muffins, brownies). Not suitable for recipes needing lift or where egg flavor matters.",
        "science": "<p>Ground flaxseed contains mucilage, a type of soluble fiber that becomes gel-like when hydrated. This gel mimics the binding properties of egg proteins by creating a network that holds ingredients together.</p><p>However, eggs provide leavening through air incorporation when beaten, and structure through protein coagulation when heated—functions flax cannot replicate.</p><p>That's why flax eggs work beautifully in dense, moist recipes (muffins, brownies) but fail in recipes requiring lift (soufflés, angel food cake).</p>"
      },
      {
        "name": "Chia Egg",
        "ratio": "1 tablespoon chia seeds + 3 tablespoons water, rest 5 min = 1 egg",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Chia seeds form a gel similar to flax, providing binding properties.",
        "notes": "May leave visible specks. Best for darker baked goods like chocolate recipes.",
        "science": "<p>Chia seeds contain similar mucilaginous compounds to flax. When mixed with water, they form a gel through the hydration of soluble fiber on the seed's surface.</p><p>The binding power is comparable to flax, but chia has a more neutral taste. The seeds remain visible as small specks, which is why they work better in darker batters where they're less noticeable.</p>"
      },
      {
        "name": "Mashed Banana",
        "ratio": "1/4 cup mashed ripe banana = 1 egg",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides moisture and binding. Natural sugars add sweetness.",
        "notes": "Will add banana flavor. Best for quick breads, muffins, pancakes. Reduce sugar in recipe slightly.",
        "science": "<p>Bananas contain pectin and starches that provide binding and moisture. The natural sugars (fructose and glucose) add sweetness and promote Maillard browning during baking.</p><p>However, bananas cannot provide the protein structure or emulsification that eggs offer. The high moisture content also means results will be denser.</p><p>This substitute works best when egg's primary role is moisture and binding, not structure or leavening.</p>"
      },
      {
        "name": "Unsweetened Applesauce",
        "ratio": "1/4 cup applesauce = 1 egg",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides moisture and some binding. Pectin helps with structure.",
        "notes": "Milder flavor than banana. Good for cakes and muffins. Results may be slightly denser.",
        "science": "<p>Applesauce provides moisture through its high water content and some binding through pectin—the same compound that makes jams gel.</p><p>Pectin creates weak bonds between molecules, offering mild structural support. Unlike eggs, it can't trap air or coagulate into a firm structure when heated.</p><p>Results tend to be denser and moister, making applesauce ideal for quick breads and muffins where a tight crumb is acceptable.</p>"
      },
      {
        "name": "Silken Tofu",
        "ratio": "1/4 cup blended silken tofu = 1 egg",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "High protein content provides structure and binding similar to eggs.",
        "notes": "Blend until completely smooth. Neutral flavor works in most recipes.",
        "science": "<p>Silken tofu is made from coagulated soy milk with high water content. It contains complete protein that can provide structure and binding in baking.</p><p>When blended smooth, its neutral flavor disappears into batters. The proteins don't behave identically to egg proteins, but they do help bind ingredients and retain moisture.</p><p>For best results, blend until completely smooth to avoid any grainy texture in your final product.</p>"
      },
      {
        "name": "Commercial Egg Replacer",
        "ratio": "Follow package directions (usually 1.5 tsp powder + 2-3 tbsp water = 1 egg)",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Specifically formulated to mimic egg properties in baking.",
        "notes": "Brands like Bob's Red Mill or JUST Egg work well. Most reliable for light, fluffy results.",
        "science": "<p>Products like Bob's Red Mill contain potato starch, tapioca flour, and leavening agents specifically formulated to replicate multiple egg functions simultaneously.</p><p>The starches provide binding, the leavening creates lift, and added stabilizers help with texture. This multi-functional approach makes commercial replacers the most reliable substitute for general baking.</p>"
      },
      {
        "name": "Aquafaba",
        "ratio": "3 tablespoons aquafaba = 1 egg (or 2 tbsp = 1 egg white)",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "The liquid from canned chickpeas contains proteins that mimic egg whites. Can even be whipped to stiff peaks.",
        "notes": "Best egg substitute discovered. Works for meringues, macarons, and anything needing whipped eggs.",
        "science": "<p>Aquafaba—the liquid from canned chickpeas—contains proteins (albumins), saponins, and carbohydrates that closely mimic egg white composition.</p><p>Saponins are natural surfactants that stabilize air bubbles by reducing surface tension at the air-water interface. The proteins can denature and set when heated, providing structure.</p><p>This is why aquafaba can be whipped to stiff peaks and used in meringues—it's not just mimicking eggs, it's using remarkably similar chemistry.</p>"
      }
    ]
  },
  "egg_whites": {
    "name": "Egg Whites",
    "category": "eggs",
    "aliases": [
      "egg white",
      "albumen"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "protein": "10-11%",
      "function": "leavening when whipped, binding, creates structure, clarifying stocks"
    },
    "substitutions": [
      {
        "name": "Aquafaba",
        "ratio": "2 tablespoons aquafaba = 1 egg white",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Chickpea liquid contains saponins and proteins that whip exactly like egg whites, creating stable foam.",
        "notes": "Can make meringues, macarons, marshmallows. Whip with cream of tartar for stability. Use liquid from unsalted chickpeas.",
        "science": "<p>Aquafaba's ability to mimic egg whites stems from its unique composition. During cooking, chickpeas release albumin-type proteins and saponins into the water.</p><p>Saponins are amphiphilic molecules—they have both water-loving and water-fearing parts—that act as natural surfactants. They stabilize the air-water interface in foams, preventing bubbles from collapsing.</p><p>Research shows aquafaba can achieve nearly identical foam stability to egg whites. The proteins can even denature and set when heated, providing structure for baked meringues.</p>"
      },
      {
        "name": "Meringue Powder",
        "ratio": "2 teaspoons meringue powder + 2 tablespoons water = 1 egg white",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Dried egg whites with stabilizers. Reconstitutes to functional egg white.",
        "notes": "Shelf-stable and consistent. Great for royal icing and meringue.",
        "science": "<p>Meringue powder is dehydrated egg whites with added stabilizers like cream of tartar and cornstarch. When reconstituted, the proteins (ovalbumin, ovotransferrin) regain their foaming ability.</p><p>The added stabilizers compensate for any protein damage during dehydration, making it more foolproof than fresh egg whites. This is why it's preferred for royal icing—consistent results every time.</p>"
      },
      {
        "name": "Agar Agar + Water (whipped)",
        "ratio": "1 tablespoon agar powder + 1 tablespoon water, chill, then whip with 1 tbsp water",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Agar creates a gel that can be whipped into foam. Provides structure without eggs.",
        "notes": "Technique is tricky. Results are less stable than real egg whites. For vegan mousses.",
        "science": "<p>Agar creates a gel through hydrogen bonding between its long polysaccharide chains. When this gel is chilled and then whipped, it can incorporate air.</p><p>However, the resulting foam is less stable than egg white foam and doesn't provide the same protein structure when baked. It works for vegan mousses but requires careful technique.</p>"
      }
    ]
  },
  "egg_yolks": {
    "name": "Egg Yolks",
    "category": "eggs",
    "aliases": [
      "egg yolk",
      "yolk"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "26-27%",
      "function": "emulsification, richness, color, thickening custards, tenderizing"
    },
    "substitutions": [
      {
        "name": "Silken Tofu (blended)",
        "ratio": "1/4 cup blended silken tofu = 2 egg yolks",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Provides similar richness and binding. Neutral flavor allows it to blend in.",
        "notes": "Blend until completely smooth. Add pinch of turmeric for yellow color if desired.",
        "science": "<p>Silken tofu provides similar richness to egg yolks through its combination of protein and fat. When blended smooth, it creates a creamy consistency comparable to yolk.</p><p>However, it lacks lecithin—the key emulsifying compound in egg yolks. For recipes where emulsification is critical (like mayonnaise), you may need to add a supplemental emulsifier.</p><p>Adding a pinch of turmeric can replicate egg yolk's characteristic yellow color.</p>"
      },
      {
        "name": "Mayonnaise",
        "ratio": "1 tablespoon mayonnaise = 1 egg yolk",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Mayo IS egg yolk + oil, already emulsified. Provides same fat and emulsification.",
        "notes": "Adds moisture and tenderness. Great for cakes. Use unflavored mayo.",
        "science": "<p>Mayonnaise is already an emulsion of egg yolk, oil, and acid—essentially pre-emulsified egg yolk with added fat. The lecithin in egg yolks acts as an emulsifier, with hydrophilic heads attracted to water and hydrophobic tails attracted to fat.</p><p>This is exactly what egg yolks do in batters. Using mayo in baking adds moisture, fat, and already-activated emulsifiers, often producing exceptionally moist cakes.</p>"
      },
      {
        "name": "Nut Butter",
        "ratio": "1 tablespoon nut butter = 1 egg yolk",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides fat and binding. Creates richness similar to yolks.",
        "notes": "Will add flavor. Best in cookies, brownies, or recipes where nut flavor complements.",
        "science": "<p>Nut butters provide fat and some protein for binding, similar to egg yolks. The high fat content (around 50%) creates richness and tenderness in baked goods.</p><p>Unlike egg yolks, nut butters don't emulsify or thicken when heated. They work best in cookies and brownies where their flavor complements the recipe.</p>"
      },
      {
        "name": "Mashed Avocado",
        "ratio": "2 tablespoons mashed avocado = 1 egg yolk",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "High fat content mimics yolk's richness. Creates tender baked goods.",
        "notes": "May add slight green tint and mild flavor. Best in chocolate recipes.",
        "science": "<p>Avocados are roughly 77% fat, primarily monounsaturated oleic acid. This high fat content mimics egg yolk's richness and tenderizing effect.</p><p>The fruit also contains natural emulsifiers that help bind ingredients. The mild flavor largely disappears in baking, especially in chocolate recipes where the green color is also masked.</p>"
      },
      {
        "name": "Soy Lecithin",
        "ratio": "1 teaspoon soy lecithin = 1 egg yolk (for emulsification only)",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Lecithin is the emulsifying compound in egg yolks. Provides same emulsification power.",
        "notes": "Only for emulsification (dressings, sauces). Doesn't provide richness or thickening for custards.",
        "science": "<p>Lecithin is the actual emulsifying compound in egg yolks, extracted here from soybeans. The molecule has a phosphate head (hydrophilic) and fatty acid tails (hydrophobic), allowing it to stabilize oil-water mixtures.</p><p>Use this only when emulsification is the goal—it won't provide the color, flavor, richness, or thickening that whole yolks offer. A little goes a long way.</p>"
      }
    ]
  },
  "butter": {
    "name": "Butter",
    "category": "fats",
    "aliases": [
      "unsalted butter",
      "salted butter"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "80-82%",
      "water": "16-18%",
      "function": "tenderizes, adds richness, creates flaky layers, browning"
    },
    "substitutions": [
      {
        "name": "Coconut Oil",
        "ratio": "1 cup coconut oil = 1 cup butter",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar fat content and solid-at-room-temperature property. Creates good flaky texture.",
        "notes": "Use refined coconut oil for neutral flavor, or virgin for subtle coconut taste. Works especially well in pie crusts and cookies.",
        "science": "<p>Butter is approximately 80% fat, 16-18% water, and 2-4% milk solids. Coconut oil is 100% fat with a similar melting point (76°F vs butter's 90-95°F).</p><p>Both fats are high in saturated fatty acids, which is why they're solid at room temperature. This solid-to-liquid transition is crucial for flaky pastries—fat must be cold and solid to create distinct layers.</p><p>The higher fat content in coconut oil means slightly more tender results. Use refined coconut oil for neutral flavor.</p>"
      },
      {
        "name": "Vegetable Oil",
        "ratio": "3/4 cup oil = 1 cup butter (for moisture); 7/8 cup for 1:1 fat content",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Provides fat for tenderness and moisture. Use less because oil is 100% fat vs butter's 80%.",
        "notes": "Cannot create flaky layers (pie crust, croissants). Best for cakes, muffins, quick breads. Results are more moist and dense.",
        "science": "<p>Oil is 100% liquid fat with no water content, fundamentally changing baking chemistry. Butter's water creates steam for lift and its milk solids enable Maillard browning.</p><p>Oil provides tenderness through fat coating flour proteins (shortening effect), but cannot create flaky layers since there's no solid-to-liquid phase change.</p><p>Use 3/4 cup oil per cup butter to account for butter's water content. Results will be more moist and dense.</p>"
      },
      {
        "name": "Greek Yogurt",
        "ratio": "1/2 cup Greek yogurt = 1 cup butter",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides moisture and tenderness with much less fat. Protein adds structure.",
        "notes": "Significantly reduces fat and calories. Best for cakes and muffins. Not for cookies or pastries.",
        "science": "<p>Greek yogurt substitutes fat with protein and moisture. The high protein content provides structure, while lactic acid tenderizes gluten.</p><p>This creates tender results with significantly less fat and calories. The tangy flavor can actually enhance certain recipes. Best for cakes and muffins, not cookies or pastries.</p>"
      },
      {
        "name": "Applesauce",
        "ratio": "1/2 cup applesauce = 1 cup butter",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides moisture. Pectin helps with structure.",
        "notes": "Major texture change - use only when reducing fat is priority. Best combined with some oil (1/4 cup applesauce + 1/4 cup oil).",
        "science": "<p>Applesauce provides moisture and pectin (for some binding) but virtually no fat. Using it alone dramatically changes texture.</p><p>The best approach is combining applesauce with some oil—this provides moisture reduction benefits while maintaining enough fat for proper texture. Expect denser, more cake-like results.</p>"
      },
      {
        "name": "Avocado",
        "ratio": "1 cup mashed avocado = 1 cup butter",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar fat content with healthy fats. Creamy texture works well in baking.",
        "notes": "May add slight green tint. Best for chocolate recipes where color is masked. Very rich results.",
        "science": "<p>Avocados contain about 77% fat, primarily heart-healthy monounsaturated oleic acid. The creamy texture and high fat content make it an effective butter substitute.</p><p>The fats coat flour proteins similarly to butter, creating tenderness. Avocado also contains fiber and emulsifying compounds that help bind batters.</p><p>Best used in chocolate recipes where the green color and mild flavor are masked.</p>"
      },
      {
        "name": "Vegan Butter",
        "ratio": "1 cup vegan butter = 1 cup butter",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Formulated to mimic butter's fat content and water content exactly.",
        "notes": "Brands like Miyoko's or Earth Balance work well. Some contain palm oil. Check if solid vs spreadable.",
        "science": "<p>Commercial vegan butters are specifically formulated to mimic dairy butter's fat content (80%) and water content (16-18%). They typically use a blend of oils (coconut, palm, canola) to achieve the right melting point.</p><p>This engineering makes them the most reliable butter substitute for any application—baking, cooking, or spreading. Check whether the product is solid (for pastries) or spreadable (for general use).</p>"
      }
    ]
  },
  "shortening": {
    "name": "Shortening",
    "category": "fats",
    "aliases": [
      "vegetable shortening",
      "Crisco"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "fat": "100%",
      "function": "creates tender, flaky texture, no water content, high smoke point"
    },
    "substitutions": [
      {
        "name": "Coconut Oil (solid)",
        "ratio": "1 cup solid coconut oil = 1 cup shortening",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Similar 100% fat content and solid texture at room temperature. Creates flaky pastry.",
        "notes": "Use refined for neutral flavor. Keep very cold for pie crusts. Melts faster than shortening.",
        "science": "<p>Both shortening and coconut oil are 100% fat with no water content. Coconut oil's melting point (76°F) is close to shortening's, making it behave similarly in baking.</p><p>The key to flaky pastry is keeping fat cold and solid until it hits oven heat, then melting to create steam pockets. Coconut oil does this well, though it melts faster than shortening.</p><p>Use refined coconut oil for neutral flavor, and keep ingredients very cold when making pie crust.</p>"
      },
      {
        "name": "Butter",
        "ratio": "1 cup + 2 tablespoons butter = 1 cup shortening",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Butter is 80% fat vs shortening's 100%, so use slightly more. Adds flavor but contains water.",
        "notes": "Results less flaky, more tender. Butter adds better flavor. Keep very cold for pastry.",
        "science": "<p>Butter is only 80% fat compared to shortening's 100%, and contains 16-18% water. You need slightly more butter to match the fat content.</p><p>The water in butter actually creates steam, which adds some lift but can also make pastry less flaky if overworked. The milk solids add wonderful flavor and promote browning.</p><p>For pie crusts, very cold butter creates tender, flavorful (though less flaky) results.</p>"
      },
      {
        "name": "Lard",
        "ratio": "1 cup lard = 1 cup shortening",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same 100% fat, solid texture. Traditional before vegetable shortening existed.",
        "notes": "Makes incredibly flaky pie crusts. Slight savory flavor. Not vegetarian.",
        "science": "<p>Lard is 100% fat like shortening, but it's animal-derived (rendered pork fat). It creates exceptionally flaky pastry because its fat crystals have an ideal size and structure for layering.</p><p>Traditional pie bakers often prefer lard for its superior flakiness. It has a subtle savory flavor that works wonderfully in pie crusts and biscuits. Not suitable for vegetarians.</p>"
      },
      {
        "name": "Vegan Butter (solid block style)",
        "ratio": "1 cup + 2 tablespoons vegan butter = 1 cup shortening",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar fat properties to regular butter. Use slightly more to account for water content.",
        "notes": "Must use block-style, not spreadable. Keep cold for pastry work.",
        "science": "<p>Block-style vegan butter is formulated to be solid at room temperature, unlike spreadable varieties. This makes it suitable for pastry work.</p><p>Like dairy butter, it contains water (around 16-18%), so you need slightly more. Keep it very cold for flaky results. The water content means slightly less flakiness than shortening but better flavor.</p>"
      }
    ]
  },
  "lard": {
    "name": "Lard",
    "category": "fats",
    "aliases": [
      "pork fat",
      "rendered pork fat"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "100%",
      "function": "extremely flaky pastry, high smoke point, savory depth"
    },
    "substitutions": [
      {
        "name": "Shortening",
        "ratio": "1 cup shortening = 1 cup lard",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same 100% fat, solid texture. Vegetarian alternative.",
        "notes": "Less flavorful but same flakiness. Good for those avoiding pork.",
        "science": "<p>Vegetable shortening replaced lard in many American kitchens during the 20th century. Both are 100% fat with similar textures.</p><p>Shortening produces good flakiness but lacks lard's superior fat crystal structure. It also has no flavor of its own, while lard has a subtle savory note.</p><p>For vegetarians or those avoiding pork, shortening is the closest textural substitute.</p>"
      },
      {
        "name": "Butter",
        "ratio": "1 cup butter + 2 tablespoons = 1 cup lard",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides richness, though with water content. Creates tender rather than flaky.",
        "notes": "Different texture - more tender, less flaky. Better flavor in some applications.",
        "science": "<p>Butter provides better flavor than lard but different textural results. The water content (16-18%) creates steam during baking, affecting flakiness.</p><p>Butter makes pastry more tender but less flaky than lard. The milk solids add browning and rich flavor. Many bakers combine butter and lard for both flavor and flakiness.</p>"
      },
      {
        "name": "Coconut Oil",
        "ratio": "1 cup coconut oil = 1 cup lard",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "100% fat, solid at room temp. Creates good flakiness.",
        "notes": "Use refined for neutral flavor. Works for savory and sweet. Vegan option.",
        "science": "<p>Coconut oil is 100% fat and solid at room temperature, similar to lard. It creates good flakiness in pastry, though with a slightly different texture.</p><p>Use refined coconut oil for neutral flavor. The plant-based fat is a good option for those avoiding animal products. Keep it very cold when making pastry.</p>"
      },
      {
        "name": "Bacon Fat",
        "ratio": "1 cup bacon fat = 1 cup lard",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Also rendered pork fat. Same properties with smoky flavor.",
        "notes": "Adds smoky, savory depth. Best for savory applications. Not for sweet pastries.",
        "science": "<p>Bacon fat is rendered pork fat like lard, but with smoky, savory flavor compounds from the curing and smoking process.</p><p>It has identical fat properties to lard and creates excellent flakiness. The smoky flavor makes it ideal for savory applications—biscuits, cornbread, pot pie crusts—but not for sweet pastries.</p>"
      }
    ]
  },
  "baking_soda": {
    "name": "Baking Soda",
    "category": "leavening",
    "aliases": [
      "bicarbonate of soda",
      "sodium bicarbonate"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "leavening (requires acid to activate), browning, tenderizing"
    },
    "substitutions": [
      {
        "name": "Baking Powder",
        "ratio": "1 teaspoon baking powder = 1/4 teaspoon baking soda",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Baking powder contains baking soda plus acid. You need 4x as much because it's diluted.",
        "notes": "Only works if recipe has no other acid (buttermilk, yogurt, lemon). If recipe has acid, the extra acid in baking powder may cause metallic taste.",
        "science": "<p>Baking soda is pure sodium bicarbonate (NaHCO₃). Baking powder is sodium bicarbonate PLUS a dry acid (usually cream of tartar or sodium aluminum sulfate) and cornstarch as a buffer.</p><p>Since the acid is pre-included and the mixture is diluted with cornstarch, you need about 4 times as much baking powder to achieve the same leavening.</p><p>Important: if your recipe already contains acid (buttermilk, yogurt, vinegar), the extra acid in baking powder may over-acidify your batter, creating a metallic taste.</p>"
      },
      {
        "name": "Self-Rising Flour (replace all-purpose)",
        "ratio": "Replace all-purpose flour with self-rising flour, omit baking soda and salt",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Self-rising flour contains baking powder and salt already.",
        "notes": "Only works if you're also using all-purpose flour in the recipe. Ratio of leavening may not be exact.",
        "science": "<p>Self-rising flour is all-purpose flour pre-mixed with baking powder and salt. It provides convenient leavening but at fixed ratios.</p><p>When substituting, you're essentially replacing your leavening system entirely. This works best when the original recipe uses all-purpose flour and baking soda together.</p>"
      },
      {
        "name": "Potassium Bicarbonate",
        "ratio": "1 teaspoon potassium bicarbonate = 1 teaspoon baking soda",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same chemical reaction, just with potassium instead of sodium. Identical leavening power.",
        "notes": "Sodium-free alternative for those on restricted diets. Slightly different aftertaste.",
        "science": "<p>Potassium bicarbonate (KHCO₃) undergoes the same acid-base reaction as sodium bicarbonate, producing CO₂ for leavening. The chemistry is identical.</p><p>The only difference is the metal ion—potassium instead of sodium. This makes it ideal for those on sodium-restricted diets. There may be a very slight difference in aftertaste.</p>"
      }
    ]
  },
  "baking_powder": {
    "name": "Baking Powder",
    "category": "leavening",
    "aliases": [
      "double-acting baking powder"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "leavening (self-contained acid + base system)"
    },
    "substitutions": [
      {
        "name": "Baking Soda + Cream of Tartar",
        "ratio": "1/4 teaspoon baking soda + 1/2 teaspoon cream of tartar = 1 teaspoon baking powder",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "This IS what baking powder is - baking soda plus an acid (cream of tartar). Same chemistry.",
        "notes": "This is single-acting (reacts immediately). Work quickly and get batter in oven fast.",
        "science": "<p>This combination recreates baking powder from first principles. Cream of tartar (potassium bitartrate) is a dry acid that reacts with baking soda when liquid is added.</p><p>The reaction: NaHCO₃ + KHC₄H₄O₆ → CO₂ + H₂O + KNaC₄H₄O₆. The CO₂ gas creates bubbles that leaven your batter.</p><p>Commercial baking powder is \"double-acting\"—it reacts twice (when wet, then when heated). This homemade version is single-acting, so work quickly once mixed.</p>"
      },
      {
        "name": "Baking Soda + Lemon Juice",
        "ratio": "1/4 teaspoon baking soda + 1/2 teaspoon lemon juice = 1 teaspoon baking powder",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Lemon juice provides the acid to activate the baking soda.",
        "notes": "May add slight lemon flavor. Single-acting, so work quickly.",
        "science": "<p>Citric acid in lemon juice reacts with sodium bicarbonate to produce carbon dioxide: 3NaHCO₃ + C₆H₈O₇ → 3CO₂ + 3H₂O + Na₃C₆H₅O₇.</p><p>The reaction begins immediately upon contact, so you lose some leavening power while mixing. Get your batter in the oven quickly.</p><p>This may add a subtle lemon flavor to your baked goods—sometimes desirable, sometimes not.</p>"
      },
      {
        "name": "Baking Soda + Vinegar",
        "ratio": "1/4 teaspoon baking soda + 1/2 teaspoon white vinegar = 1 teaspoon baking powder",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Vinegar provides acid. The reaction is the classic 'volcano' effect.",
        "notes": "Use white vinegar for neutral flavor. Apple cider vinegar adds slight taste. Work quickly!",
        "science": "<p>Acetic acid in vinegar provides the acid for the classic acid-base reaction with baking soda. This is the same chemistry as the classic \"volcano\" science experiment.</p><p>White vinegar has the most neutral flavor. The reaction is immediate and vigorous, so mix quickly and bake promptly to capture the leavening gas.</p>"
      },
      {
        "name": "Baking Soda + Yogurt or Buttermilk",
        "ratio": "1/4 teaspoon baking soda + 1/2 cup yogurt or buttermilk (replace some liquid) = 1 teaspoon baking powder",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Cultured dairy provides lactic acid to activate baking soda.",
        "notes": "Reduce other liquid in recipe by 1/2 cup. Adds tangy flavor and tenderness.",
        "science": "<p>Cultured dairy products contain lactic acid from bacterial fermentation. This acid reacts with baking soda to produce CO₂.</p><p>The reaction is gentler than with vinegar or lemon juice, and the dairy adds its own benefits: tenderizing proteins, adding moisture, and contributing tangy flavor.</p><p>Reduce other liquids in your recipe by the amount of dairy added.</p>"
      },
      {
        "name": "Self-Rising Flour (replace all-purpose)",
        "ratio": "Replace all-purpose flour with self-rising flour, omit baking powder and salt",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Self-rising flour = all-purpose flour + baking powder + salt.",
        "notes": "1 cup self-rising flour contains about 1.5 teaspoons baking powder and 1/4 teaspoon salt.",
        "science": "<p>Self-rising flour contains approximately 1.5 teaspoons baking powder and 1/4 teaspoon salt per cup. It's a convenient all-in-one solution.</p><p>When substituting, remove both the baking powder and salt from your recipe. The fixed ratios work well for biscuits, pancakes, and quick breads.</p>"
      }
    ]
  },
  "cream_of_tartar": {
    "name": "Cream of Tartar",
    "category": "leavening",
    "aliases": [
      "potassium bitartrate",
      "tartaric acid"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "stabilizes egg whites, activates baking soda, prevents sugar crystallization"
    },
    "substitutions": [
      {
        "name": "Lemon Juice",
        "ratio": "1 teaspoon lemon juice = 1/2 teaspoon cream of tartar",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Both are acids. Lemon juice can stabilize egg whites and activate baking soda similarly.",
        "notes": "Use for meringues and baking soda activation. May add slight lemon flavor.",
        "science": "<p>Both cream of tartar and lemon juice are acids, but they work differently. Cream of tartar (potassium bitartrate) is a dry acid that activates when liquid is added. Citric acid in lemon juice is already in solution.</p><p>For stabilizing egg whites, both acids work by lowering pH, which strengthens the protein network that traps air. Lemon juice works slightly faster.</p><p>For activating baking soda, lemon juice provides equivalent acid. It may add subtle citrus flavor.</p>"
      },
      {
        "name": "White Vinegar",
        "ratio": "1 teaspoon white vinegar = 1/2 teaspoon cream of tartar",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Acetic acid provides similar acidic function.",
        "notes": "Good for stabilizing egg whites. Neutral flavor when used in small amounts.",
        "science": "<p>Acetic acid in vinegar serves the same acidifying function as tartaric acid. It stabilizes egg white foams by denaturing proteins at the air-water interface.</p><p>The sharp vinegar taste disappears during baking, leaving no detectable flavor. Use white vinegar for the most neutral result.</p>"
      },
      {
        "name": "Baking Powder (replace baking soda + cream of tartar)",
        "ratio": "1 teaspoon baking powder = 1/4 tsp baking soda + 1/2 tsp cream of tartar",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "If recipe calls for both, baking powder combines them already.",
        "notes": "Only use this substitution if recipe calls for BOTH baking soda and cream of tartar together.",
        "science": "<p>When a recipe calls for both baking soda AND cream of tartar, it's essentially creating baking powder from scratch. Commercial baking powder combines these two ingredients (plus a starch buffer).</p><p>Substituting baking powder for the combination simplifies your ingredient list and provides more consistent results, since commercial products are precisely measured.</p>"
      }
    ]
  },
  "yeast": {
    "name": "Active Dry Yeast",
    "category": "leavening",
    "aliases": [
      "yeast",
      "dry yeast",
      "baker's yeast"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "biological leavening through fermentation, develops flavor, creates bread texture"
    },
    "substitutions": [
      {
        "name": "Instant Yeast",
        "ratio": "Use same amount, skip proofing step",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same organism, just processed differently. Can be mixed directly into flour.",
        "notes": "No need to dissolve in warm water first. Slightly faster rise time.",
        "science": "<p>Both active dry and instant yeast are the same organism: Saccharomyces cerevisiae. The difference is processing method.</p><p>Active dry yeast is dried at higher temperatures, killing outer cells and creating a protective dead cell layer. This layer must dissolve in warm water (proofing) before the living inner cells can activate.</p><p>Instant yeast is dried more gently, leaving more cells alive and directly accessible. It can be mixed straight into flour without proofing.</p>"
      },
      {
        "name": "Fresh Yeast (Cake Yeast)",
        "ratio": "Use 2-3x the amount of fresh yeast (1 packet dry = 2/3 oz fresh)",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same organism in fresh form. More perishable but works identically.",
        "notes": "Crumble and dissolve in liquid. Must be refrigerated. Check expiration date.",
        "science": "<p>Fresh yeast is the original form—live yeast cells compressed into a moist cake. It's more perishable but many bakers prefer its performance.</p><p>The yeast cells are already fully hydrated and active, so fermentation begins quickly. Use 2-3 times the weight of fresh yeast compared to dry yeast.</p><p>Fresh yeast must be refrigerated and used within a couple weeks. Check for off odors before using.</p>"
      },
      {
        "name": "Sourdough Starter",
        "ratio": "1 cup active starter = 1 packet yeast (reduce flour and liquid by 1/2 cup each)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Wild yeast and bacteria. Provides leavening plus complex flavor.",
        "notes": "Much longer rise time (6-12 hours). Adds tangy flavor. Adjust flour/liquid in recipe.",
        "science": "<p>Sourdough starter is a symbiotic culture of wild yeasts AND lactic acid bacteria. The yeasts (often Saccharomyces and Candida species) provide leavening, while bacteria (Lactobacillus) produce acids that give sourdough its tang.</p><p>Fermentation is much slower—often 6-12 hours or overnight—but produces more complex flavors through extended enzymatic activity.</p><p>You'll need to adjust flour and liquid in your recipe since starter contains both. Expect about 1 cup starter to replace 1 packet yeast.</p>"
      },
      {
        "name": "Baking Powder (for quick breads only)",
        "ratio": "1 teaspoon baking powder per cup of flour",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Chemical leavening can substitute in some recipes, but won't develop yeast flavor or texture.",
        "notes": "NOT for bread - only for things like pizza dough in a pinch. No rise time needed but texture is different.",
        "science": "<p>Baking powder provides chemical leavening—CO₂ from an acid-base reaction—rather than biological leavening from yeast fermentation.</p><p>This works for quick breads where you don't need the flavor development and gluten structure that long fermentation provides. It's not suitable for traditional bread, which relies on yeast for texture and taste.</p><p>The advantage is speed: no rising time required.</p>"
      }
    ]
  },
  "heavy_cream": {
    "name": "Heavy Cream",
    "category": "dairy",
    "aliases": [
      "heavy whipping cream",
      "double cream"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "36-40%",
      "function": "richness, whipping, thickening sauces, tenderizing baked goods"
    },
    "substitutions": [
      {
        "name": "Coconut Cream",
        "ratio": "1 cup coconut cream = 1 cup heavy cream",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar fat content and thickness. Can even be whipped when very cold.",
        "notes": "Adds coconut flavor. Refrigerate can overnight, use only the solid cream on top. Great for dairy-free.",
        "science": "<p>Heavy cream's whipping ability comes from fat globules (36-40% fat) surrounded by protein membranes. When whipped, air is incorporated and fat globules cluster around air bubbles, stabilizing them.</p><p>Coconut cream has similar fat content (24%+) and can form comparable structures when very cold. The fat must be solid to trap air effectively.</p><p>Refrigerate the can overnight, then scoop only the solid cream. The coconut flavor is noticeable but complements many desserts.</p>"
      },
      {
        "name": "Milk + Butter",
        "ratio": "3/4 cup milk + 1/4 cup melted butter = 1 cup heavy cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Adds fat back to low-fat milk to approximate cream's richness.",
        "notes": "Cannot be whipped. Good for sauces, soups, baking. May separate if boiled - add at end of cooking.",
        "science": "<p>This combination attempts to reconstruct cream's fat content by adding butter (80% fat) to milk (3.25% fat). The math works out to similar fat levels.</p><p>However, the emulsion is unstable because the fat isn't properly homogenized with the milk proteins. Homogenization in real cream breaks fat into tiny droplets coated with proteins.</p><p>This substitute works for adding richness to sauces but will break (separate) if boiled or whipped.</p>"
      },
      {
        "name": "Greek Yogurt + Milk",
        "ratio": "1/2 cup Greek yogurt + 1/2 cup milk = 1 cup heavy cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Provides thickness and tang. Lower fat but good body.",
        "notes": "Cannot be whipped. Add at end of cooking to prevent curdling. Adds tangy flavor.",
        "science": "<p>This combination provides thickness from yogurt's strained proteins and moisture from milk. The result approximates cream's body without matching its fat content.</p><p>Greek yogurt is tangy from lactic acid fermentation, which adds flavor. The proteins may curdle if heated too aggressively.</p><p>Best for cold applications or adding at the end of cooking. Cannot be whipped.</p>"
      },
      {
        "name": "Evaporated Milk",
        "ratio": "1 cup evaporated milk = 1 cup heavy cream",
        "reliability": "good",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Concentrated milk with similar consistency. About 6-8% fat.",
        "notes": "Cannot be whipped unless very cold (and even then, not as well). Slightly caramelized flavor.",
        "science": "<p>Evaporated milk is regular milk with 60% of its water removed through vacuum evaporation. This concentrates the proteins, fat (6-8%), and sugars.</p><p>The concentration gives it body similar to cream despite lower fat. The heating process also causes slight Maillard browning, adding a subtle caramelized flavor.</p><p>Can be whipped if ultra-cold, but the foam is less stable than cream.</p>"
      },
      {
        "name": "Silken Tofu + Soy Milk",
        "ratio": "1/2 cup blended silken tofu + 1/2 cup soy milk = 1 cup cream",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates creamy consistency for sauces. Dairy-free option.",
        "notes": "Cannot be whipped. Blend until very smooth. Neutral flavor.",
        "science": "<p>Blending silken tofu with soy milk creates a creamy emulsion with neutral flavor. The soy proteins provide body and some emulsification.</p><p>This vegan option works well in sauces and soups where cream provides richness and body. It cannot be whipped.</p><p>Blend until completely smooth to avoid any graininess.</p>"
      },
      {
        "name": "Cashew Cream",
        "ratio": "1 cup cashew cream = 1 cup heavy cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Blended cashews create rich, creamy texture similar to cream.",
        "notes": "Soak 1 cup raw cashews 4+ hours, blend with 1/2-3/4 cup water until smooth. Cannot whip.",
        "science": "<p>Soaked cashews blended with water create a remarkably cream-like emulsion. Cashews are high in fat and starch, which emulsify smoothly.</p><p>The resulting cream is rich, neutral-flavored, and works in both sweet and savory applications. It's especially popular in vegan cooking for sauces and soups.</p><p>Cannot be whipped, but provides excellent richness.</p>"
      }
    ]
  },
  "half_and_half": {
    "name": "Half-and-Half",
    "category": "dairy",
    "aliases": [
      "half and half",
      "coffee cream"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "fat": "10-12%",
      "function": "adds richness without heaviness of cream, for coffee and sauces"
    },
    "substitutions": [
      {
        "name": "Milk + Heavy Cream",
        "ratio": "1/2 cup whole milk + 1/2 cup heavy cream = 1 cup half-and-half",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "This IS what half-and-half is - half milk, half cream. Identical result.",
        "notes": "Perfect substitute. Can adjust ratio for lighter or richer result."
      },
      {
        "name": "Milk + Butter",
        "ratio": "1 cup milk + 1.5 tablespoons melted butter = 1 cup half-and-half",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Butter adds fat to bring milk's richness up to half-and-half level.",
        "notes": "May separate if heated too high. Best for baking and sauces that aren't boiled."
      },
      {
        "name": "Evaporated Milk (diluted)",
        "ratio": "1/2 cup evaporated milk + 1/2 cup water = 1 cup half-and-half",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Evaporated milk has similar fat content. Diluting gets right consistency.",
        "notes": "Adds slightly caramelized flavor. Good for coffee and sauces."
      },
      {
        "name": "Oat Creamer",
        "ratio": "1 cup oat creamer = 1 cup half-and-half",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Formulated to mimic half-and-half's fat content and mouthfeel.",
        "notes": "Dairy-free option. Brands like Oatly Barista work well. May separate when heated."
      }
    ]
  },
  "evaporated_milk": {
    "name": "Evaporated Milk",
    "category": "dairy",
    "aliases": [
      "unsweetened condensed milk"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "6-8%",
      "function": "concentrated milk flavor, creamy texture, doesn't require refrigeration"
    },
    "substitutions": [
      {
        "name": "Heavy Cream (for richness)",
        "ratio": "3/4 cup heavy cream + 1/4 cup water = 1 cup evaporated milk",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Provides similar richness when diluted. Higher fat than evaporated milk.",
        "notes": "Results will be richer. Good for pumpkin pie and creamy sauces."
      },
      {
        "name": "Homemade: Simmer Regular Milk",
        "ratio": "2.25 cups whole milk simmered down to 1 cup = evaporated milk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "This IS how evaporated milk is made - milk with 60% of water removed.",
        "notes": "Simmer milk uncovered for 25-30 min, stirring, until reduced by more than half."
      },
      {
        "name": "Half-and-Half",
        "ratio": "1 cup half-and-half = 1 cup evaporated milk",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar fat content and consistency.",
        "notes": "Slightly thinner. Works well in most recipes. Not shelf-stable like canned."
      },
      {
        "name": "Coconut Milk (full fat)",
        "ratio": "1 cup full-fat coconut milk = 1 cup evaporated milk",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar creamy consistency and fat content. Dairy-free option.",
        "notes": "Adds coconut flavor. Works well in curries, pumpkin pie, and sweet recipes."
      }
    ]
  },
  "sweetened_condensed_milk": {
    "name": "Sweetened Condensed Milk",
    "category": "dairy",
    "aliases": [
      "condensed milk"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "sugar": "40-45%",
      "function": "extreme sweetness, thick sticky texture, essential for fudge and key lime pie"
    },
    "substitutions": [
      {
        "name": "Homemade: Milk + Sugar (simmered)",
        "ratio": "1.5 cups whole milk + 3/4 cup sugar, simmer 40 min until thick = ~1 cup condensed milk",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "This IS how condensed milk is made - milk cooked with sugar until reduced and thick.",
        "notes": "Stir frequently to prevent scorching. Cool before using. Result should coat a spoon thickly."
      },
      {
        "name": "Evaporated Milk + Sugar",
        "ratio": "1 cup evaporated milk + 1.25 cups sugar, heat until dissolved = ~1.5 cups condensed milk",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Evaporated milk is already concentrated. Adding sugar creates similar product.",
        "notes": "Heat and stir until sugar fully dissolves and mixture thickens. Let cool."
      },
      {
        "name": "Coconut Condensed Milk",
        "ratio": "1 can (14 oz) coconut condensed milk = 1 can regular condensed milk",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Same texture and sweetness level. Vegan alternative.",
        "notes": "Adds coconut flavor. Available in most grocery stores. Great for dairy-free desserts."
      },
      {
        "name": "Cream + Sugar + Butter",
        "ratio": "1 cup heavy cream + 1 cup sugar + 3 tbsp butter, simmer until thick",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Creates similar thick, sweet consistency through different method.",
        "notes": "More like a caramel sauce. Works for some recipes but different texture."
      }
    ]
  },
  "coconut_milk_canned": {
    "name": "Coconut Milk (Canned/Full Fat)",
    "category": "dairy",
    "aliases": [
      "full fat coconut milk",
      "thick coconut milk"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "fat": "17-24%",
      "function": "rich creamy base for curries, soups, desserts, dairy-free cooking"
    },
    "substitutions": [
      {
        "name": "Coconut Cream + Water",
        "ratio": "1/2 cup coconut cream + 1/2 cup water = 1 cup coconut milk",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Coconut cream is just concentrated coconut milk. Diluting recreates full-fat coconut milk.",
        "notes": "Adjust ratio for thicker or thinner consistency as needed."
      },
      {
        "name": "Heavy Cream (for richness, different flavor)",
        "ratio": "1 cup heavy cream = 1 cup coconut milk",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar fat content and creamy texture. Different flavor profile.",
        "notes": "Won't have coconut flavor. Works when you need the fat/creaminess but not the taste."
      },
      {
        "name": "Cashew Cream",
        "ratio": "1 cup cashew cream = 1 cup coconut milk",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar creamy, rich texture. Neutral flavor.",
        "notes": "Blend 1 cup soaked cashews with 1 cup water. Dairy-free and coconut-free."
      },
      {
        "name": "Greek Yogurt + Water",
        "ratio": "1/2 cup Greek yogurt + 1/2 cup water = 1 cup coconut milk (for curries)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides creaminess and body similar to coconut milk.",
        "notes": "Adds tangy flavor. Traditional in some Indian curries. Add at end to prevent curdling."
      }
    ]
  },
  "milk": {
    "name": "Milk (Whole)",
    "category": "dairy",
    "aliases": [
      "whole milk",
      "regular milk"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "3.25%",
      "function": "moisture, tenderness, browning (lactose), flavor"
    },
    "substitutions": [
      {
        "name": "Oat Milk",
        "ratio": "1 cup oat milk = 1 cup whole milk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar consistency and neutral flavor. Contains some fat and natural sugars for browning.",
        "notes": "Best plant milk for baking. Creamy texture closest to dairy milk.",
        "science": "<p>Oat milk is made by blending oats with water and straining. The result contains beta-glucans (soluble fiber) that give it a creamy mouthfeel remarkably similar to dairy milk.</p><p>It contains some protein and natural sugars that participate in Maillard browning during baking. Fat content varies by brand (typically 2-5%), approaching whole milk levels.</p><p>The neutral flavor and similar behavior make it the top plant milk for baking.</p>"
      },
      {
        "name": "Soy Milk",
        "ratio": "1 cup soy milk = 1 cup whole milk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Highest protein of plant milks, similar to dairy. Good browning.",
        "notes": "Slight bean flavor in some brands. Unsweetened, unflavored works best.",
        "science": "<p>Soy milk has the highest protein content of plant milks (6-8g per cup, similar to cow's milk at 8g). These proteins can coagulate and contribute to structure similarly to dairy casein.</p><p>The proteins also participate in Maillard browning, helping baked goods develop golden color. Natural emulsifiers in soy help with batter consistency.</p><p>Some brands have a beany flavor from lipoxygenase enzymes—choose unflavored, unsweetened varieties for baking.</p>"
      },
      {
        "name": "Almond Milk",
        "ratio": "1 cup almond milk = 1 cup whole milk",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Works as liquid replacement. Much lower in protein and fat.",
        "notes": "Thinner than dairy milk. May result in slightly less tender baked goods. Subtle nutty flavor.",
        "science": "<p>Almond milk is lower in both protein and fat than dairy milk. It works as a liquid substitute but won't contribute the same structural properties.</p><p>Baked goods may be slightly less tender due to reduced protein interference with gluten. The subtle nutty flavor usually disappears in baking.</p><p>Choose unsweetened varieties to maintain proper sugar balance in recipes.</p>"
      },
      {
        "name": "Coconut Milk (carton, not canned)",
        "ratio": "1 cup coconut milk beverage = 1 cup whole milk",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar consistency to dairy milk. Contains some fat.",
        "notes": "Adds subtle coconut flavor. Don't confuse with thick canned coconut milk.",
        "science": "<p>Carton coconut milk (a beverage) is diluted to have similar consistency to dairy milk, unlike thick canned coconut milk.</p><p>It contains more fat than almond milk but less protein than soy. The coconut flavor is subtle and complements many baked goods.</p><p>Don't confuse with canned coconut milk, which is much thicker and fattier.</p>"
      },
      {
        "name": "Half-and-Half + Water",
        "ratio": "1/2 cup half-and-half + 1/2 cup water = 1 cup whole milk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Dilutes the higher fat of half-and-half to approximate whole milk.",
        "notes": "Good option if you have half-and-half but no milk.",
        "science": "<p>Half-and-half is half milk, half cream (about 12% fat). Diluting it 1:1 with water brings the fat content down to approximately that of whole milk (3.25%).</p><p>This works perfectly when you have half-and-half but no milk. The proteins and sugars are slightly more concentrated than regular milk, but this rarely matters.</p>"
      },
      {
        "name": "Powdered Milk (reconstituted)",
        "ratio": "1/3 cup powdered milk + 1 cup water = 1 cup milk",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Dried milk reconstitutes to the same product. Shelf-stable option.",
        "notes": "Follow package directions for ratio. Works well in baking where fresh milk taste isn't critical.",
        "science": "<p>Powdered milk is made by spray-drying fresh milk, removing water while preserving proteins, fats, and sugars. Reconstituting with water reverses the process.</p><p>The proteins may be slightly denatured from heat during drying, but this rarely affects baking results. The convenience of shelf-stable storage makes it a valuable pantry item.</p>"
      }
    ]
  },
  "sour_cream": {
    "name": "Sour Cream",
    "category": "dairy",
    "aliases": [
      "cultured cream"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "18-20%",
      "function": "tangy flavor, moisture, tenderizes baked goods, richness in sauces"
    },
    "substitutions": [
      {
        "name": "Greek Yogurt",
        "ratio": "1 cup Greek yogurt = 1 cup sour cream",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Nearly identical taste and consistency. Same tangy, cultured flavor.",
        "notes": "Full-fat Greek yogurt is closest. Lower fat works but slightly less rich.",
        "science": "<p>Both sour cream and Greek yogurt are cultured dairy products with lactic acid bacteria. The fermentation produces the characteristic tang.</p><p>Greek yogurt has more protein and less fat than sour cream, but similar acidity and thickness. Full-fat Greek yogurt is closest in richness.</p><p>The cultures behave identically in baking, tenderizing gluten and activating leavening. Most people can't detect any difference.</p>"
      },
      {
        "name": "Cottage Cheese (blended)",
        "ratio": "1 cup cottage cheese, blended smooth = 1 cup sour cream",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "When blended, has similar consistency and tangy flavor.",
        "notes": "Must blend until completely smooth. Add 1-2 tablespoons milk if too thick.",
        "science": "<p>Cottage cheese is curds of casein protein in whey. When blended smooth, the curds break down into a creamy texture similar to sour cream.</p><p>The tanginess comes from the same lactic acid fermentation. Blending thoroughly is essential—any remaining curds create unwanted texture.</p><p>Add a splash of milk if needed to achieve the right consistency.</p>"
      },
      {
        "name": "Cream Cheese + Milk",
        "ratio": "6 oz cream cheese + 2 tablespoons milk, blended = 1 cup sour cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar richness and tang when thinned with milk.",
        "notes": "Slightly denser. Best for dips and sauces, not ideal for baking.",
        "science": "<p>Cream cheese is a fresh, high-fat cultured cheese. Thinning with milk approximates sour cream's consistency.</p><p>The fat content is higher than sour cream, making results richer. The tang is similar since both use lactic acid cultures.</p><p>Better for dips and sauces than for baking, where the higher fat might affect texture.</p>"
      },
      {
        "name": "Coconut Cream + Lemon",
        "ratio": "1 cup coconut cream + 1 tablespoon lemon juice = 1 cup sour cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Coconut cream provides richness, lemon adds tang. Dairy-free option.",
        "notes": "Will have coconut undertone. Let sit 10 min to thicken and develop tang.",
        "science": "<p>Coconut cream provides the fat and thickness of sour cream. Lemon juice adds the acid that creates tanginess.</p><p>The result has a subtle coconut undertone. Letting it sit for 10 minutes allows the acid to thicken the proteins slightly.</p><p>This dairy-free option works well in most applications except where sour cream's specific cultures matter.</p>"
      },
      {
        "name": "Mexican Crema",
        "ratio": "1 cup Mexican crema = 1 cup sour cream",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar cultured cream product. Slightly thinner and milder.",
        "notes": "Great for tacos and Mexican dishes. Pourable consistency.",
        "science": "<p>Mexican crema is a cultured cream very similar to sour cream but with slightly lower acidity and higher fat content. It's thinner and more pourable.</p><p>The cultures are similar—both use lactic acid bacteria. Crema's milder tang and creamier texture make it ideal for drizzling over tacos and Mexican dishes.</p>"
      }
    ]
  },
  "cream_cheese": {
    "name": "Cream Cheese",
    "category": "dairy",
    "aliases": [
      "Philadelphia cream cheese",
      "brick cream cheese"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "33%",
      "function": "richness, tangy flavor, creamy texture, stabilizes frostings and cheesecakes"
    },
    "substitutions": [
      {
        "name": "Mascarpone",
        "ratio": "1 cup mascarpone = 1 cup cream cheese",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar richness and consistency. Mascarpone is slightly sweeter and less tangy.",
        "notes": "Italian cream cheese essentially. Perfect for cheesecakes and frostings.",
        "science": "<p>Both cream cheese and mascarpone are fresh, high-fat cheeses made by acidifying cream. The difference is the acid used.</p><p>Cream cheese uses lactic acid bacterial cultures, creating tanginess. Mascarpone uses citric or tartaric acid, resulting in a milder, sweeter flavor.</p><p>The fat content is similar (33% vs 40%), and both provide the dense, spreadable texture needed for cheesecakes and frostings.</p>"
      },
      {
        "name": "Greek Yogurt (strained overnight)",
        "ratio": "1 cup strained Greek yogurt = 1 cup cream cheese",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "When strained, achieves similar thick consistency. Similar tang.",
        "notes": "Strain through cheesecloth 8+ hours. Lower fat, more protein. Works for dips and spreads.",
        "science": "<p>Greek yogurt already has much whey removed. Further straining concentrates proteins and fat while removing more liquid.</p><p>After 8+ hours of straining through cheesecloth, the consistency approaches cream cheese. The tanginess comes from the same lactic acid found in cream cheese.</p><p>Fat content is lower, making this a lighter option. Works for dips and spreads; may affect cheesecake texture.</p>"
      },
      {
        "name": "Ricotta (blended)",
        "ratio": "1 cup ricotta, blended smooth = 1 cup cream cheese",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides creamy cheese texture. Slightly grainy but works in baking.",
        "notes": "Blend until completely smooth. Best in baked applications, not raw spreads.",
        "science": "<p>Ricotta is a fresh Italian cheese made from whey proteins rather than casein. When blended smooth, it achieves a spreadable consistency.</p><p>The flavor is milder and slightly grainy compared to cream cheese. Blending helps but doesn't completely eliminate the grain.</p><p>Works better in baked applications like cheesecake, where baking smooths the texture.</p>"
      },
      {
        "name": "Cottage Cheese (blended)",
        "ratio": "1 cup cottage cheese, blended very smooth = 1 cup cream cheese",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "When blended smooth, provides similar texture with less fat.",
        "notes": "Must blend thoroughly. Lower fat, higher protein. Best for dips and cooking.",
        "science": "<p>Cottage cheese is casein curds in whey. Blending breaks down the curds into a smooth spread.</p><p>It's lower in fat and higher in protein than cream cheese. Must be blended very thoroughly—any remaining curds affect texture significantly.</p><p>The lighter profile makes it good for dips and cooking, less ideal for rich desserts.</p>"
      },
      {
        "name": "Cashew Cream Cheese",
        "ratio": "1 cup cashew cream cheese = 1 cup dairy cream cheese",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Vegan option with similar spreadable texture.",
        "notes": "Homemade: blend soaked cashews with lemon juice and salt. Or use store-bought (Miyoko's, Kite Hill).",
        "science": "<p>Soaked raw cashews blended with lemon juice, salt, and often probiotics create a cream cheese analogue. The cashew fats emulsify smoothly.</p><p>Adding probiotics or rejuvelac (fermented grain water) introduces cultured tanginess. Even without culturing, lemon juice provides acidity.</p><p>Commercial versions (Miyoko's, Kite Hill) have perfected the texture and flavor through controlled fermentation.</p>"
      }
    ]
  },
  "yogurt": {
    "name": "Yogurt (Plain)",
    "category": "dairy",
    "aliases": [
      "plain yogurt",
      "regular yogurt"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "3-5% (whole milk yogurt)",
      "function": "tangy flavor, tenderness in baking, marinades (tenderizes meat), probiotics"
    },
    "substitutions": [
      {
        "name": "Sour Cream",
        "ratio": "1 cup sour cream = 1 cup yogurt",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Both are cultured dairy with similar acidity and tang. Sour cream is richer.",
        "notes": "Results will be slightly richer. Works perfectly in baking and sauces.",
        "science": "<p>Both yogurt and sour cream are fermented dairy with lactic acid bacteria cultures. The main difference is fat content: sour cream has 18-20% fat versus yogurt's 3-5%.</p><p>In baking, both provide acidity that tenderizes gluten and activates baking soda. Sour cream's higher fat creates richer results.</p><p>The cultures are interchangeable for their functional properties.</p>"
      },
      {
        "name": "Buttermilk",
        "ratio": "3/4 cup buttermilk = 1 cup yogurt (reduce other liquids)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar cultured tang and acidity. Thinner consistency.",
        "notes": "Buttermilk is thinner - reduce other liquids in recipe or use less.",
        "science": "<p>Buttermilk is thinner than yogurt but has similar cultured tanginess from lactic acid fermentation. Use less (about 3/4 cup) to compensate for yogurt's thickness.</p><p>You may need to reduce other liquids in the recipe. The acidity and tenderizing effects are equivalent.</p>"
      },
      {
        "name": "Cottage Cheese (blended)",
        "ratio": "1 cup blended cottage cheese = 1 cup yogurt",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "When blended smooth, similar consistency and mild tangy flavor.",
        "notes": "Blend until completely smooth. Add splash of milk if needed for consistency.",
        "science": "<p>Cottage cheese blended smooth approximates yogurt's texture and mild tangy flavor. It's higher in protein and has different fat distribution.</p><p>The lactic acid content is similar, providing comparable functionality in cooking. Add a splash of milk for proper consistency.</p>"
      },
      {
        "name": "Coconut Yogurt",
        "ratio": "1 cup coconut yogurt = 1 cup dairy yogurt",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Same cultured, tangy properties. Dairy-free alternative.",
        "notes": "Adds subtle coconut flavor. Works well in baking and smoothies.",
        "science": "<p>Coconut yogurt is made by fermenting coconut cream with the same bacterial cultures used for dairy yogurt. The fermentation produces identical lactic acid.</p><p>The result is tangy and creamy like dairy yogurt. Coconut fat is more saturated than dairy fat, so texture may differ slightly.</p><p>A completely dairy-free option that works in most recipes.</p>"
      },
      {
        "name": "Silken Tofu + Lemon Juice",
        "ratio": "1 cup blended silken tofu + 1 tablespoon lemon juice = 1 cup yogurt",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Tofu provides creamy texture, lemon adds tang. Vegan option.",
        "notes": "Blend until completely smooth. Good for dressings and smoothies.",
        "science": "<p>Blended silken tofu creates a creamy base, while lemon juice adds the acidity that yogurt provides through fermentation.</p><p>The protein content is similar, though soy proteins behave differently than dairy casein. Works well for smoothies and dressings.</p><p>For baking, the acid from lemon provides similar functionality to lactic acid.</p>"
      }
    ]
  },
  "all_purpose_flour": {
    "name": "All-Purpose Flour",
    "category": "flour",
    "aliases": [
      "AP flour",
      "plain flour",
      "white flour"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "protein": "10-12%",
      "function": "structure, binding, thickening, base for most baked goods"
    },
    "substitutions": [
      {
        "name": "Bread Flour",
        "ratio": "1 cup bread flour = 1 cup all-purpose flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Higher protein (12-14%) makes slightly chewier texture.",
        "notes": "Results will be slightly chewier and more elastic. Great for pizza dough. Avoid for tender cakes.",
        "science": "Flour protein content determines gluten development potential. All-purpose flour has 10-12% protein, while bread flour has 12-14%. This extra protein creates more gluten, resulting in chewier texture and better structure for bread. Using bread flour in cookies or cakes will make them slightly tougher and chewier."
      },
      {
        "name": "Cake Flour",
        "ratio": "1 cup + 2 tablespoons cake flour = 1 cup all-purpose flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Lower protein (7-9%), so use slightly more. Results are more tender.",
        "notes": "Results will be more delicate and tender. Not for bread or pizza.",
        "science": "Cake flour is milled from soft wheat with only 7-9% protein and is often bleached. Bleaching oxidizes the flour proteins, further weakening their gluten-forming ability and allowing them to hold more sugar and fat. This creates the tender, fine crumb characteristic of cakes. You need more cake flour because it's less dense."
      },
      {
        "name": "Whole Wheat Flour",
        "ratio": "Replace up to 50% (1/2 cup whole wheat + 1/2 cup AP = 1 cup AP)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Higher fiber and protein. 100% substitution makes dense, heavy results.",
        "notes": "Replace only half for best results. Products will be denser and nuttier. May need more liquid."
      },
      {
        "name": "Gluten-Free Flour Blend",
        "ratio": "1 cup GF blend = 1 cup all-purpose flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Blends are formulated to mimic AP flour behavior. Usually contain rice flour, tapioca, and xanthan gum.",
        "notes": "Use blends with xanthan gum already added (Bob's Red Mill 1-to-1, King Arthur Measure for Measure). Results may be slightly different texture.",
        "science": "Good GF blends combine rice flour (for neutral flavor and structure), tapioca or potato starch (for binding and chewiness), and xanthan gum (to mimic gluten's elasticity). Without gluten, there's no protein network to trap gas and create structure, so these blends use starches and gums to approximate those functions."
      },
      {
        "name": "Almond Flour (partial)",
        "ratio": "Replace up to 25% (1/4 cup almond + 3/4 cup AP = 1 cup AP)",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Adds moisture and richness but no gluten. Can't fully replace.",
        "notes": "100% almond flour requires completely different recipe. Partial substitution adds nutty flavor and moisture."
      }
    ]
  },
  "cake_flour": {
    "name": "Cake Flour",
    "category": "flour",
    "aliases": [
      "soft flour",
      "pastry flour"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "protein": "7-9%",
      "function": "creates tender, fine crumb in cakes and delicate baked goods"
    },
    "substitutions": [
      {
        "name": "All-Purpose Flour + Cornstarch",
        "ratio": "1 cup minus 2 tablespoons AP flour + 2 tablespoons cornstarch = 1 cup cake flour",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Cornstarch dilutes protein and interferes with gluten formation, mimicking low-protein cake flour.",
        "notes": "Sift together several times for even distribution. Works very well for cakes."
      },
      {
        "name": "All-Purpose Flour (straight substitution)",
        "ratio": "1 cup AP flour = 1 cup cake flour",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Will work but produces slightly different texture due to higher protein.",
        "notes": "Results will be slightly denser and less tender. Mix less to reduce gluten development."
      }
    ]
  },
  "bread_flour": {
    "name": "Bread Flour",
    "category": "flour",
    "aliases": [
      "strong flour",
      "high-gluten flour"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "protein": "12-14%",
      "function": "creates chewy texture, strong gluten network for bread structure"
    },
    "substitutions": [
      {
        "name": "All-Purpose Flour + Vital Wheat Gluten",
        "ratio": "1 cup AP flour + 1 teaspoon vital wheat gluten = 1 cup bread flour",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Vital wheat gluten is pure protein. Adding it increases protein content to match bread flour.",
        "notes": "Best substitute for bread. Creates the chewy texture and good rise."
      },
      {
        "name": "All-Purpose Flour (straight substitution)",
        "ratio": "1 cup AP flour = 1 cup bread flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "AP flour can make bread, just with slightly less chew and rise.",
        "notes": "Results will be acceptable but less chewy. Fine for home bread baking."
      }
    ]
  },
  "self_rising_flour": {
    "name": "Self-Rising Flour",
    "category": "flour",
    "aliases": [
      "self-raising flour"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "flour with leavening and salt already added, for quick breads and biscuits"
    },
    "substitutions": [
      {
        "name": "All-Purpose Flour + Baking Powder + Salt",
        "ratio": "1 cup AP flour + 1.5 teaspoons baking powder + 1/4 teaspoon salt = 1 cup self-rising flour",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "This IS what self-rising flour is - just AP flour with leavening and salt pre-mixed.",
        "notes": "Perfect substitute. Whisk together well before using."
      },
      {
        "name": "Cake Flour + Baking Powder + Salt",
        "ratio": "1 cup cake flour + 1.5 teaspoons baking powder + 1/4 teaspoon salt = 1 cup self-rising flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "For more tender results like Southern-style biscuits.",
        "notes": "Results will be more tender and delicate. Traditional for fluffy biscuits."
      }
    ]
  },
  "cornstarch": {
    "name": "Cornstarch",
    "category": "thickeners",
    "aliases": [
      "corn starch",
      "maize starch"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "function": "thickening sauces, gives glossy finish, lightens baked goods"
    },
    "substitutions": [
      {
        "name": "All-Purpose Flour",
        "ratio": "2 tablespoons flour = 1 tablespoon cornstarch",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Flour thickens well but needs twice as much. Contains protein so it's not as pure a starch.",
        "notes": "Must cook 2-3 minutes to remove raw flour taste. Results are opaque, not glossy. Make a slurry first.",
        "science": "<p>Cornstarch is pure starch (chains of amylose and amylopectin), while flour contains starch plus 10-12% protein (gluten-forming).</p><p>Starch thickens by absorbing water and swelling when heated—a process called gelatinization. The starch granules burst and release their contents, creating thickness.</p><p>Flour's proteins create cloudiness and require longer cooking to remove the raw taste. You need twice as much flour since only about half is starch.</p>"
      },
      {
        "name": "Arrowroot Powder",
        "ratio": "1 tablespoon arrowroot = 1 tablespoon cornstarch",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Nearly identical thickening power. Also a pure starch.",
        "notes": "Creates glossy, clear sauces like cornstarch. Doesn't hold up to prolonged cooking or reheating.",
        "science": "<p>Arrowroot is a pure starch extracted from the Maranta arundinacea plant. It gelatinizes at a lower temperature than cornstarch.</p><p>The resulting gel is exceptionally clear and glossy—even more so than cornstarch. This makes it ideal for fruit glazes and clear sauces.</p><p>However, arrowroot breaks down with prolonged heating or freezing. Use it for sauces served immediately.</p>"
      },
      {
        "name": "Tapioca Starch",
        "ratio": "2 tablespoons tapioca starch = 1 tablespoon cornstarch",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Another pure starch thickener. Creates slightly chewy, glossy texture.",
        "notes": "Can become stringy if overcooked. Great for fruit pies.",
        "science": "<p>Tapioca starch comes from cassava root. It has a unique ratio of amylose to amylopectin that creates a slightly chewy, stretchy texture.</p><p>This makes it perfect for fruit pie fillings—they hold together when sliced but have pleasant texture. It also creates glossy sauces.</p><p>Overheating makes tapioca stringy, so use it for dishes that won't be cooked too long.</p>"
      },
      {
        "name": "Potato Starch",
        "ratio": "1 tablespoon potato starch = 1 tablespoon cornstarch",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar thickening power to cornstarch. Pure starch with neutral flavor.",
        "notes": "Breaks down at high heat or with prolonged cooking. Add at end.",
        "science": "<p>Potato starch has large granules that swell dramatically when heated. It creates a clear, glossy gel similar to cornstarch.</p><p>However, potato starch is more fragile—it breaks down with prolonged cooking or when reheated. It also has a slightly lower gelatinization temperature.</p><p>Add near the end of cooking for best results. Popular in gluten-free and Passover baking.</p>"
      },
      {
        "name": "Rice Flour",
        "ratio": "2 tablespoons rice flour = 1 tablespoon cornstarch",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides thickening, though not as strong as pure starch.",
        "notes": "Creates slightly grainy texture. Best for gravies where smoothness isn't critical.",
        "science": "<p>Rice flour contains starch plus some protein, similar to wheat flour. It provides thickening but creates a slightly grainy texture.</p><p>The proteins prevent the completely smooth gel that pure starches achieve. Better for rustic gravies and sauces where perfect smoothness isn't critical.</p><p>Use twice as much as cornstarch.</p>"
      }
    ]
  },
  "cocoa_powder": {
    "name": "Cocoa Powder (Unsweetened)",
    "category": "chocolate",
    "aliases": [
      "natural cocoa",
      "dutch process cocoa"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "chocolate flavor, affects leavening chemistry (natural is acidic, Dutch is neutral)"
    },
    "substitutions": [
      {
        "name": "Unsweetened Baking Chocolate",
        "ratio": "1 oz unsweetened chocolate (melted) = 3 tablespoons cocoa + 1 tablespoon fat",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Baking chocolate is cocoa solids + cocoa butter. Need to reduce fat in recipe.",
        "notes": "Reduce butter/oil in recipe by 1 tablespoon per ounce of chocolate used. Richer flavor."
      },
      {
        "name": "Dutch Process ↔ Natural Cocoa Swap",
        "ratio": "Use same amount but adjust leavening",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Natural cocoa is acidic (works with baking soda). Dutch is neutral (needs baking powder).",
        "notes": "Swapping natural for Dutch: replace baking soda with baking powder (3x amount). Swapping Dutch for natural: replace baking powder with baking soda (1/3 amount)."
      },
      {
        "name": "Carob Powder",
        "ratio": "1 tablespoon carob = 1 tablespoon cocoa",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Similar appearance and can provide brown color. Naturally sweet.",
        "notes": "VERY different flavor - earthy and sweet, not chocolatey. Reduce sugar. Not a true chocolate substitute."
      },
      {
        "name": "Hot Cocoa Mix (in a pinch)",
        "ratio": "3 tablespoons hot cocoa mix - 1 tablespoon sugar = ~2 tablespoons cocoa",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Contains cocoa powder plus sugar and milk powder.",
        "notes": "Reduce sugar in recipe significantly. Results will be sweeter and less intense."
      }
    ]
  },
  "unsweetened_chocolate": {
    "name": "Unsweetened Baking Chocolate",
    "category": "chocolate",
    "aliases": [
      "baking chocolate",
      "bitter chocolate"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "cocoa_solids": "99%+",
      "function": "pure chocolate flavor, richness, no added sugar"
    },
    "substitutions": [
      {
        "name": "Cocoa Powder + Fat",
        "ratio": "3 tablespoons cocoa powder + 1 tablespoon butter/oil = 1 oz unsweetened chocolate",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Unsweetened chocolate is just cocoa solids and cocoa butter. This recreates it.",
        "notes": "Use neutral oil or butter depending on recipe. Melt butter first if using."
      },
      {
        "name": "Semisweet Chocolate",
        "ratio": "1 oz semisweet = 1 oz unsweetened (reduce sugar by 1 tablespoon)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Semisweet contains sugar. Reducing recipe sugar compensates.",
        "notes": "Result will be slightly less intense. Works for brownies and cakes."
      }
    ]
  },
  "semisweet_chocolate": {
    "name": "Semisweet Chocolate",
    "category": "chocolate",
    "aliases": [
      "dark chocolate",
      "bittersweet chocolate",
      "chocolate chips"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "cocoa_solids": "35-60%",
      "function": "balanced chocolate flavor with sweetness"
    },
    "substitutions": [
      {
        "name": "Unsweetened Chocolate + Sugar",
        "ratio": "1 oz unsweetened chocolate + 1 tablespoon sugar = 1 oz semisweet",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Semisweet is unsweetened chocolate with sugar added. This recreates the formula.",
        "notes": "Melt chocolate, stir in sugar until dissolved. Adjust sugar to taste."
      },
      {
        "name": "Cocoa Powder + Sugar + Fat",
        "ratio": "1 tablespoon cocoa + 1 tablespoon sugar + 2 teaspoons butter = ~1/2 oz semisweet",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Builds chocolate from components. Works when you're out of chocolate.",
        "notes": "Melt butter, mix in cocoa and sugar. Won't have exact texture of solid chocolate."
      },
      {
        "name": "Milk Chocolate",
        "ratio": "1 cup milk chocolate = 1 cup semisweet",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Both are sweetened chocolates. Milk chocolate is sweeter and milder.",
        "notes": "Results will be sweeter and less intensely chocolate. May want to reduce sugar slightly."
      }
    ]
  },
  "white_sugar": {
    "name": "White Sugar (Granulated)",
    "category": "sweeteners",
    "aliases": [
      "granulated sugar",
      "table sugar",
      "cane sugar"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "sweetness, tenderizing, browning, feeds yeast, adds crispness to cookies"
    },
    "substitutions": [
      {
        "name": "Brown Sugar",
        "ratio": "1 cup packed brown sugar = 1 cup white sugar",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Brown sugar is white sugar + molasses. Adds moisture and chewiness.",
        "notes": "Results will be more moist and chewy with caramel notes. May spread more when baking."
      },
      {
        "name": "Coconut Sugar",
        "ratio": "1 cup coconut sugar = 1 cup white sugar",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar sweetness level. Lower glycemic index.",
        "notes": "Adds caramel/brown sugar flavor. Won't cream as smoothly. Slightly less sweet."
      },
      {
        "name": "Honey",
        "ratio": "3/4 cup honey = 1 cup sugar (reduce liquid by 1/4 cup, add 1/4 tsp baking soda)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Honey is sweeter than sugar. Liquid form requires recipe adjustment.",
        "notes": "Reduce other liquids and oven temp by 25°F to prevent over-browning. Adds honey flavor."
      },
      {
        "name": "Maple Syrup",
        "ratio": "3/4 cup maple syrup = 1 cup sugar (reduce liquid by 3 tablespoons)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar sweetness to honey. Requires liquid adjustment.",
        "notes": "Reduce other liquids. Adds maple flavor. Lower oven temp slightly."
      },
      {
        "name": "Stevia (for sweetness only)",
        "ratio": "1 teaspoon stevia extract = 1 cup sugar (sweetness only)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides sweetness without calories or carbs.",
        "notes": "Does NOT provide bulk, browning, or texture. Only use in recipes where sugar's only role is sweetness (drinks, sauces). Not for baking."
      }
    ]
  },
  "powdered_sugar": {
    "name": "Powdered Sugar",
    "category": "sweeteners",
    "aliases": [
      "confectioner's sugar",
      "icing sugar",
      "10x sugar"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "smooth frostings, dissolves instantly, dusting, no graininess"
    },
    "substitutions": [
      {
        "name": "Homemade: Granulated Sugar (blended)",
        "ratio": "1 cup granulated sugar + 1 tablespoon cornstarch, blended = 1 cup powdered sugar",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Powdered sugar is just finely ground sugar with anti-caking agent (usually cornstarch).",
        "notes": "Blend in high-powered blender or food processor for 1-2 minutes until powdery. Sift before using."
      },
      {
        "name": "Coconut Sugar (blended)",
        "ratio": "1 cup coconut sugar, blended fine = 1 cup powdered sugar",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Can be ground fine, though won't be as white or dissolve as smoothly.",
        "notes": "Results will be tan colored with caramel flavor. Works for rustic frostings."
      }
    ]
  },
  "brown_sugar": {
    "name": "Brown Sugar",
    "category": "sweeteners",
    "aliases": [
      "light brown sugar",
      "dark brown sugar"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "sweetness, moisture, chewy texture, caramel/molasses flavor"
    },
    "substitutions": [
      {
        "name": "White Sugar + Molasses",
        "ratio": "1 cup white sugar + 1 tablespoon molasses = 1 cup light brown sugar; use 2 tablespoons molasses for dark brown",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "This IS what brown sugar is - white sugar with molasses added back.",
        "notes": "Mix thoroughly. This is the perfect substitute - same chemistry.",
        "science": "<p>Brown sugar is literally white sugar with molasses added. During sugar refining, molasses is removed from raw cane juice to create white sugar. Adding it back creates brown sugar.</p><p>Light brown sugar contains about 3.5% molasses; dark brown has about 6.5%. This formula perfectly replicates commercial brown sugar.</p><p>The molasses provides moisture, mineral content, and the flavor compounds that give brown sugar its character.</p>"
      },
      {
        "name": "Coconut Sugar",
        "ratio": "1 cup coconut sugar = 1 cup brown sugar",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar caramel flavor and color. Contains some moisture.",
        "notes": "Slightly less sweet, grainier texture. Won't cream as smoothly with butter.",
        "science": "<p>Coconut sugar is made by evaporating sap from coconut palm flower buds. It contains sucrose (like cane sugar) plus minerals and inulin fiber from the sap.</p><p>The caramel flavor comes from Maillard reactions during evaporation. It has a lower glycemic index than white sugar.</p><p>Won't cream as smoothly as brown sugar due to different crystal structure, but provides similar flavor.</p>"
      },
      {
        "name": "Maple Sugar",
        "ratio": "1 cup maple sugar = 1 cup brown sugar",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Provides similar moisture and caramel-like depth.",
        "notes": "Adds maple flavor. Expensive but delicious in cookies.",
        "science": "<p>Maple sugar is crystallized maple syrup—all the water is evaporated, leaving pure maple crystals. It contains sucrose plus maple's distinctive flavor compounds.</p><p>The moisture content and behavior are similar to brown sugar. The flavor is different but provides comparable depth and complexity.</p><p>More expensive but delicious in cookies and recipes where maple complements.</p>"
      },
      {
        "name": "White Sugar (in a pinch)",
        "ratio": "1 cup white sugar = 1 cup brown sugar",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides sweetness, though missing moisture and flavor.",
        "notes": "Cookies will be crisper and less chewy. Flavor will be less complex.",
        "science": "<p>White sugar provides sweetness but lacks the moisture and flavor compounds in molasses. Results will be noticeably different.</p><p>Cookies made with white sugar are crisper and spread more (brown sugar's acidity creates a chewier texture). The caramel notes will be absent.</p><p>Only use when you have no other options.</p>"
      }
    ]
  },
  "molasses": {
    "name": "Molasses",
    "category": "sweeteners",
    "aliases": [
      "blackstrap molasses",
      "light molasses",
      "dark molasses"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "function": "deep caramel flavor, moisture, acidity, minerals, essential for gingerbread"
    },
    "substitutions": [
      {
        "name": "Dark Corn Syrup",
        "ratio": "1 cup dark corn syrup = 1 cup molasses",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar consistency and some caramel flavor. Less complex than molasses.",
        "notes": "Milder flavor. Works in recipes where molasses isn't the star flavor."
      },
      {
        "name": "Honey + Brown Sugar",
        "ratio": "3/4 cup honey + 1/4 cup packed brown sugar = 1 cup molasses",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides thickness and some depth. Not the same flavor profile.",
        "notes": "Mix well. Results will be sweeter and less bitter. Different flavor."
      },
      {
        "name": "Maple Syrup",
        "ratio": "1 cup maple syrup = 1 cup molasses",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Similar thick liquid consistency. Different flavor profile.",
        "notes": "Very different flavor - maple instead of caramel/bitter. Works in some recipes."
      },
      {
        "name": "Date Syrup",
        "ratio": "1 cup date syrup = 1 cup molasses",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar thick, dark consistency with complex sweetness.",
        "notes": "Different flavor but good depth. Works well in gingerbread and dark cakes."
      }
    ]
  },
  "honey": {
    "name": "Honey",
    "category": "sweeteners",
    "aliases": [
      "raw honey",
      "liquid honey"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "sweetness, moisture retention, browning, antibacterial properties"
    },
    "substitutions": [
      {
        "name": "Maple Syrup",
        "ratio": "1 cup maple syrup = 1 cup honey",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar consistency, sweetness, and moisture-retaining properties.",
        "notes": "Adds distinct maple flavor. Works beautifully in most applications.",
        "science": "<p>Both honey and maple syrup are natural liquid sweeteners with similar viscosity and hygroscopic (moisture-attracting) properties.</p><p>Honey is primarily fructose and glucose from flower nectar. Maple syrup is primarily sucrose from tree sap with distinctive flavor compounds.</p><p>Both promote Maillard browning and retain moisture in baked goods. The flavor profiles differ significantly.</p>"
      },
      {
        "name": "Agave Nectar",
        "ratio": "2/3 cup agave = 1 cup honey (agave is sweeter)",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar liquid consistency. Agave is actually sweeter than honey.",
        "notes": "Neutral flavor, thinner than honey. Vegan alternative.",
        "science": "<p>Agave nectar is about 90% fructose, making it 1.5 times sweeter than honey. This is why you need less—the intense sweetness compensates.</p><p>Fructose has a lower glycemic index than glucose or sucrose. The neutral flavor and thin consistency differ from honey's distinctive taste.</p><p>It has similar hygroscopic properties, keeping baked goods moist.</p>"
      },
      {
        "name": "Corn Syrup",
        "ratio": "1 1/4 cups corn syrup = 1 cup honey (corn syrup is less sweet)",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar liquid texture and moisture properties.",
        "notes": "No distinct flavor like honey. Use light corn syrup for neutral taste.",
        "science": "<p>Corn syrup is glucose derived from corn starch through enzymatic processing. It's less sweet than honey, requiring more to achieve equivalent sweetness.</p><p>Light corn syrup has neutral flavor; dark corn syrup has molasses-like notes. Both prevent crystallization in candies and provide moisture in baking.</p>"
      },
      {
        "name": "Molasses + Sugar",
        "ratio": "3/4 cup sugar + 1/4 cup molasses = 1 cup honey",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides sweetness plus some depth and moisture.",
        "notes": "Adds strong molasses flavor - good in gingerbread, not for delicate recipes.",
        "science": "<p>This combination provides sweetness from sugar and some of honey's depth from molasses. Molasses contains minerals and flavor compounds from sugar refining.</p><p>The result won't match honey's floral complexity but provides similar moisture retention. Works well in dark, spiced baked goods.</p>"
      },
      {
        "name": "Brown Rice Syrup",
        "ratio": "1 1/4 cups brown rice syrup = 1 cup honey",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar sticky consistency. Less sweet than honey.",
        "notes": "Mild, slightly nutty flavor. Good vegan option.",
        "science": "<p>Brown rice syrup is made by breaking down rice starch into sugars using enzymes. It's less sweet than honey (about 50% as sweet).</p><p>The mild, slightly nutty flavor works in many applications. It provides similar moisture retention and doesn't crystallize easily.</p><p>A good vegan option when honey's specific flavor isn't essential.</p>"
      }
    ]
  },
  "maple_syrup": {
    "name": "Maple Syrup",
    "category": "sweeteners",
    "aliases": [
      "pure maple syrup",
      "real maple syrup"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "distinctive maple flavor, liquid sweetness, pairs with breakfast foods"
    },
    "substitutions": [
      {
        "name": "Honey",
        "ratio": "1 cup honey = 1 cup maple syrup",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar sweetness and consistency. Different flavor.",
        "notes": "Won't have maple flavor, but provides same sweetness and moisture."
      },
      {
        "name": "Maple-Flavored Pancake Syrup",
        "ratio": "1 cup pancake syrup = 1 cup maple syrup",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Designed to taste like maple syrup, though artificial.",
        "notes": "Fine for pancakes and waffles. Not recommended for baking where real maple flavor is important."
      },
      {
        "name": "Brown Sugar Syrup (homemade)",
        "ratio": "1 cup brown sugar + 1/4 cup water, heated until dissolved = ~1 cup maple-like syrup",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Brown sugar has similar caramel notes. Creates pourable syrup.",
        "notes": "Heat sugar and water until dissolved and slightly thickened. Different from maple but good depth."
      },
      {
        "name": "Agave Nectar",
        "ratio": "1 cup agave = 1 cup maple syrup",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar liquid consistency. Neutral flavor.",
        "notes": "Missing maple flavor but works as liquid sweetener. Slightly sweeter."
      }
    ]
  },
  "vanilla_extract": {
    "name": "Vanilla Extract",
    "category": "flavorings",
    "aliases": [
      "pure vanilla extract",
      "vanilla"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "enhances other flavors, adds warmth and complexity, signature baking aroma"
    },
    "substitutions": [
      {
        "name": "Vanilla Bean",
        "ratio": "1 inch vanilla bean (seeds scraped) = 1 teaspoon vanilla extract",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "The source of vanilla extract - pure vanilla flavor with visible specks.",
        "notes": "More expensive but more aromatic. Save the pod to make vanilla sugar.",
        "science": "<p>Vanilla extract is made by soaking vanilla beans in alcohol to extract the flavor compounds—primarily vanillin, plus hundreds of other aromatic molecules.</p><p>Using the bean directly provides these compounds more intensely, plus visible specks that many find appealing. One inch of bean equals about one teaspoon of extract.</p><p>Save the scraped pod to make vanilla sugar by burying it in granulated sugar.</p>"
      },
      {
        "name": "Vanilla Paste",
        "ratio": "1 teaspoon vanilla paste = 1 teaspoon vanilla extract",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Concentrated vanilla with bean specks. Same flavor, thicker consistency.",
        "notes": "Slightly more intense. Beautiful specks in custards and ice cream.",
        "science": "<p>Vanilla paste is a concentrated mixture of vanilla extract, vanilla bean seeds, and a thickener (usually sugar or glycerin). It provides intense flavor plus the visual appeal of bean specks.</p><p>The thicker consistency means it doesn't evaporate as readily as extract during baking. Particularly good for custards and ice creams where you want visible vanilla.</p>"
      },
      {
        "name": "Maple Syrup",
        "ratio": "1 teaspoon maple syrup = 1 teaspoon vanilla extract",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Adds similar warmth and depth, though different flavor profile.",
        "notes": "Works when vanilla complements (pancakes, oatmeal cookies). Not for vanilla-forward recipes.",
        "science": "<p>Maple syrup contains flavor compounds (primarily maple lactone) that provide similar warmth and depth to vanilla, though distinctly different.</p><p>Both are natural plant-derived flavors that complement sweet baked goods. Maple works especially well in recipes where its distinctive flavor is welcome.</p><p>Not appropriate for vanilla-forward desserts like vanilla cake.</p>"
      },
      {
        "name": "Almond Extract",
        "ratio": "1/2 teaspoon almond extract = 1 teaspoon vanilla extract",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Provides aromatic depth, though distinctly different flavor.",
        "notes": "Use half as much - almond extract is very strong. Good in cookies, cakes.",
        "science": "<p>Almond extract contains benzaldehyde, which provides a strong, distinctive nutty-floral aroma. It's much more concentrated than vanilla.</p><p>Use half as much—almond extract is powerful. The flavor complements many baked goods but is very different from vanilla.</p><p>Popular in cookies, cakes, and anything with stone fruits.</p>"
      },
      {
        "name": "Bourbon or Rum",
        "ratio": "2 teaspoons bourbon or dark rum = 1 teaspoon vanilla extract",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Vanilla extract is alcohol-based and shares some flavor compounds with aged spirits.",
        "notes": "Adds warmth and complexity. Good in adult desserts. Alcohol cooks off.",
        "science": "<p>Vanilla extract itself is alcohol-based, and aged spirits share some flavor compounds with vanilla due to lignin breakdown in wooden barrels.</p><p>Bourbon has vanillin from oak aging; rum has caramel notes from molasses. Both add warmth and complexity similar to vanilla's effect.</p><p>The alcohol cooks off during baking, leaving the flavor compounds behind.</p>"
      }
    ]
  },
  "soy_sauce": {
    "name": "Soy Sauce",
    "category": "asian",
    "aliases": [
      "shoyu",
      "dark soy sauce",
      "light soy sauce"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "umami, saltiness, color, fermented depth, essential Asian seasoning"
    },
    "substitutions": [
      {
        "name": "Tamari",
        "ratio": "1 tablespoon tamari = 1 tablespoon soy sauce",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Japanese soy sauce, usually gluten-free. Same umami and saltiness.",
        "notes": "Slightly thicker and less salty. Check label for gluten-free if needed.",
        "science": "<p>Both soy sauce and tamari are fermented soybean products using Aspergillus molds to break down soy proteins into amino acids, including glutamate for umami.</p><p>Traditional tamari uses little to no wheat (soy sauce is typically 50% wheat). This makes tamari naturally gluten-free (verify on label) with a slightly thicker texture.</p><p>The flavor is similar—both provide salt and deep umami.</p>"
      },
      {
        "name": "Coconut Aminos",
        "ratio": "1 tablespoon coconut aminos = 1 tablespoon soy sauce (add pinch of salt)",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Soy-free alternative with similar umami. Made from coconut sap.",
        "notes": "Less salty and slightly sweeter than soy sauce. Add salt to taste. Soy-free and gluten-free.",
        "science": "<p>Coconut aminos are made by fermenting coconut tree sap with salt. The fermentation produces amino acids and develops umami, though less intensely than soy fermentation.</p><p>It's naturally 73% lower in sodium than soy sauce with a slightly sweeter taste. You may need to add salt to match soy sauce's seasoning power.</p><p>Completely soy-free and usually gluten-free.</p>"
      },
      {
        "name": "Worcestershire Sauce",
        "ratio": "1 tablespoon Worcestershire = 1 tablespoon soy sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides umami and fermented depth, though different flavor profile.",
        "notes": "More vinegary and complex. Works in Western dishes, less authentic for Asian food.",
        "science": "<p>Worcestershire sauce contains fermented anchovies, tamarind, molasses, and various spices. It provides umami from both fish and fermented ingredients.</p><p>The flavor profile is more complex and vinegary than soy sauce. It works well in Western dishes but tastes less authentic in Asian recipes.</p>"
      },
      {
        "name": "Liquid Aminos",
        "ratio": "1 tablespoon liquid aminos = 1 tablespoon soy sauce",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Made from soybeans but unfermented. Similar salty, umami flavor.",
        "notes": "Gluten-free. Slightly milder and less complex than fermented soy sauce.",
        "science": "<p>Bragg's Liquid Aminos is made from unfermented soybeans treated with acidic water to release amino acids. It provides salty umami similar to soy sauce.</p><p>The lack of fermentation means fewer complex flavor compounds than traditionally brewed soy sauce. It's gluten-free since no wheat is used.</p>"
      },
      {
        "name": "Fish Sauce (diluted)",
        "ratio": "1/2 tablespoon fish sauce + 1/2 tablespoon water = 1 tablespoon soy sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides intense umami and salt. Very different flavor but similar function.",
        "notes": "Not vegetarian. Adds fishy depth. Use when soy sauce unavailable in Thai/Vietnamese cooking.",
        "science": "<p>Fish sauce provides intense umami from fermented fish proteins. It's much stronger and fishier than soy sauce, hence the dilution.</p><p>The amino acid profile differs—fish sauce has more inosinate, soy sauce has more glutamate. Used together, they create synergistic umami.</p><p>Not vegetarian. Works when authentic soy sauce isn't available.</p>"
      }
    ]
  },
  "mirin": {
    "name": "Mirin",
    "category": "asian",
    "aliases": [
      "sweet rice wine",
      "Japanese rice wine"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "adds sweetness, umami, glossy finish, tenderizes proteins, reduces fishy odors"
    },
    "substitutions": [
      {
        "name": "Sake + Sugar",
        "ratio": "1 tablespoon sake + 1/2 teaspoon sugar = 1 tablespoon mirin",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Mirin is essentially sweet sake. This recreates both components.",
        "notes": "Best substitute. Sake provides the rice wine base, sugar adds sweetness.",
        "science": "<p>Mirin is made by fermenting sweet rice with koji (Aspergillus oryzae mold) and shochu (distilled spirit). The result contains about 14% alcohol and 40-50% sugar.</p><p>Sake provides the rice-based alcohol and some umami from koji's enzymatic breakdown of proteins. Adding sugar replicates mirin's sweetness.</p><p>This combination closely approximates authentic mirin's function in cooking.</p>"
      },
      {
        "name": "Dry Sherry + Sugar",
        "ratio": "1 tablespoon dry sherry + 1/2 teaspoon sugar = 1 tablespoon mirin",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Sherry has similar depth and slight sweetness. Common Western substitute.",
        "notes": "Flavor is different but works well in most Asian recipes.",
        "science": "<p>Dry sherry undergoes a unique aging process under flor yeast, producing acetaldehyde and distinctive nutty flavors. This complexity somewhat mimics mirin's fermented depth.</p><p>Sherry is wine-based rather than rice-based, so the flavor profile differs. The addition of sugar compensates for sherry's dryness.</p><p>A common Western pantry substitute that works well in most recipes.</p>"
      },
      {
        "name": "Rice Vinegar + Sugar",
        "ratio": "1 tablespoon rice vinegar + 1 teaspoon sugar = 1 tablespoon mirin (reduce other acids)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides some of the flavor complexity, but more acidic than mirin.",
        "notes": "Use only if no alcohol options available. Reduce any other vinegar or acid in the recipe.",
        "science": "<p>This non-alcoholic option provides some rice-based flavor notes through the vinegar. The sugar adds required sweetness.</p><p>However, the result is more acidic than mirin. Reduce other acids in the recipe to compensate.</p><p>You also lose the alcohol's ability to extract and carry fat-soluble flavor compounds.</p>"
      },
      {
        "name": "White Wine + Sugar",
        "ratio": "1 tablespoon white wine + 1/2 teaspoon sugar = 1 tablespoon mirin",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides alcohol and sweetness, though different flavor profile.",
        "notes": "Acceptable substitute. Won't have the same umami depth.",
        "science": "<p>White wine provides alcohol for tenderizing proteins and extracting flavors. Sugar adds sweetness.</p><p>The grape-based flavor profile is quite different from rice-based mirin. This works when mirin's specific character isn't essential.</p>"
      }
    ]
  },
  "miso": {
    "name": "Miso Paste",
    "category": "asian",
    "aliases": [
      "miso",
      "soybean paste",
      "white miso",
      "red miso"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "adds deep umami, saltiness, fermented complexity"
    },
    "substitutions": [
      {
        "name": "Soy Sauce + Tahini",
        "ratio": "1 tablespoon soy sauce + 1 tablespoon tahini = 2 tablespoons miso",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Soy sauce provides umami and salt, tahini adds the paste-like body and slight bitterness.",
        "notes": "Won't have fermented complexity but provides similar savory depth."
      },
      {
        "name": "Soy Sauce (alone)",
        "ratio": "1/2 tablespoon soy sauce = 1 tablespoon miso (adjust salt in recipe)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both are fermented soy products with umami. Soy sauce is thinner and saltier.",
        "notes": "Reduces overall salt in recipe. Misses the paste texture and fermented depth."
      },
      {
        "name": "Fish Sauce (for umami)",
        "ratio": "1 teaspoon fish sauce = 1 tablespoon miso (adjust salt)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides intense umami, though from a different source.",
        "notes": "Not vegetarian. Very different flavor but hits the umami note. Use sparingly - very concentrated."
      },
      {
        "name": "Vegetable Bouillon Paste",
        "ratio": "1 tablespoon vegetable bouillon paste = 1 tablespoon miso",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides savory, salty paste with some umami from vegetables/yeast.",
        "notes": "Missing the fermented quality. Better than nothing for soup bases."
      }
    ]
  },
  "fish_sauce": {
    "name": "Fish Sauce",
    "category": "asian",
    "aliases": [
      "nam pla",
      "nuoc mam"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "intense umami, salt, depth without fishy taste when used properly"
    },
    "substitutions": [
      {
        "name": "Soy Sauce + Worcestershire",
        "ratio": "1 tablespoon soy sauce + 1 teaspoon Worcestershire = 1 tablespoon fish sauce",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Soy provides umami and salt, Worcestershire adds the fermented anchovy depth (it contains anchovies).",
        "notes": "Good all-purpose substitute. Worcestershire adds some of the fermented fish element.",
        "science": "<p>Fish sauce is made by fermenting fish (usually anchovies) with salt for 12-24 months. This breaks down proteins into free amino acids, especially glutamate.</p><p>Worcestershire sauce also contains fermented anchovies, contributing some fishy umami. Combined with soy sauce (rich in glutamate), this approximates fish sauce's depth.</p><p>Not vegetarian due to anchovies in Worcestershire.</p>"
      },
      {
        "name": "Soy Sauce + Lime Juice",
        "ratio": "1 tablespoon soy sauce + small squeeze of lime = 1 tablespoon fish sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Soy provides salt and umami, lime adds brightness that fish sauce contributes.",
        "notes": "Missing the depth but works for Thai salads and stir-fries.",
        "science": "<p>Soy sauce provides umami and salt. Lime juice adds the brightness that fish sauce contributes to dishes, especially Thai cuisine.</p><p>This lacks the fermented fish depth but works in stir-fries and salads where fish sauce is one of many ingredients.</p>"
      },
      {
        "name": "Coconut Aminos + Seaweed",
        "ratio": "1 tablespoon coconut aminos + pinch of crumbled nori = 1 tablespoon fish sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Coconut aminos for savory base, seaweed adds ocean/umami notes.",
        "notes": "Good vegetarian option. Less salty than soy-based substitutes.",
        "science": "<p>Coconut aminos provide a savory, slightly sweet base. Crumbled nori or other seaweed adds ocean-like umami flavors.</p><p>This vegetarian option approximates fish sauce's maritime quality without using fish. The umami isn't as intense but provides similar functionality.</p>"
      },
      {
        "name": "Anchovy Paste",
        "ratio": "1/2 teaspoon anchovy paste + 1 tablespoon water = 1 tablespoon fish sauce",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Made from the same fish, just in paste form. Same umami profile.",
        "notes": "Very close substitute. Might have slightly different texture in dressings.",
        "science": "<p>Anchovy paste is made from the same fish as fish sauce, just processed differently—ground and salted rather than liquid-fermented.</p><p>It contains equivalent levels of glutamate and inosinate (another umami compound). Diluting with water creates proper consistency and reduces saltiness.</p><p>This is the closest substitute since it's literally the same fish.</p>"
      }
    ]
  },
  "oyster_sauce": {
    "name": "Oyster Sauce",
    "category": "asian",
    "aliases": [
      "oyster flavored sauce"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "savory-sweet umami, glossy finish, essential for stir-fries"
    },
    "substitutions": [
      {
        "name": "Hoisin Sauce + Soy Sauce",
        "ratio": "1 tablespoon hoisin + 1/2 tablespoon soy sauce = 1.5 tablespoons oyster sauce",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Hoisin provides thick, sweet-savory base. Soy adds salt depth.",
        "notes": "Different flavor profile - more Chinese BBQ taste. Works well in stir-fries."
      },
      {
        "name": "Soy Sauce + Sugar",
        "ratio": "1 tablespoon soy sauce + 1/2 teaspoon sugar + 1/2 teaspoon cornstarch slurry = 1 tablespoon oyster sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Approximates the salty-sweet profile. Cornstarch adds thickness.",
        "notes": "Missing oyster umami depth but provides similar seasoning function."
      },
      {
        "name": "Mushroom Sauce (vegetarian oyster sauce)",
        "ratio": "1 tablespoon mushroom sauce = 1 tablespoon oyster sauce",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Specifically designed as vegetarian alternative. Made from mushrooms for similar umami.",
        "notes": "Available in Asian markets. Excellent vegetarian substitute with similar flavor profile."
      },
      {
        "name": "Worcestershire + Soy + Sugar",
        "ratio": "1 tsp Worcestershire + 1 tbsp soy sauce + 1/2 tsp sugar = ~1.5 tbsp oyster sauce",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Combines fermented depth with soy and sweetness.",
        "notes": "Western pantry solution. Worcestershire has anchovies, not vegetarian."
      }
    ]
  },
  "hoisin_sauce": {
    "name": "Hoisin Sauce",
    "category": "asian",
    "aliases": [
      "Chinese BBQ sauce",
      "Peking sauce"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "sweet-salty-savory, thick glaze, essential for Peking duck and moo shu"
    },
    "substitutions": [
      {
        "name": "Homemade Hoisin",
        "ratio": "4 tbsp soy sauce + 2 tbsp peanut butter + 1 tbsp honey + 2 tsp rice vinegar + 1 tsp sesame oil + pinch five-spice",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Combines the key flavor elements: soy, sweetness, nuttiness, and spices.",
        "notes": "Blend until smooth. Adjust sweetness to taste. Very close to commercial hoisin."
      },
      {
        "name": "Oyster Sauce + Honey",
        "ratio": "2 tablespoons oyster sauce + 1 tablespoon honey + dash of soy sauce = ~3 tablespoons hoisin",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Oyster sauce provides similar thick, umami base. Honey adds sweetness.",
        "notes": "Missing the spice complexity but similar texture and umami-sweet balance."
      },
      {
        "name": "Barbecue Sauce + Soy Sauce",
        "ratio": "2 tablespoons BBQ sauce + 1 tablespoon soy sauce + 1 tsp molasses = ~3 tablespoons hoisin",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "BBQ sauce has similar sweet-savory profile. Soy adds depth.",
        "notes": "Different flavor (more Western) but works in a pinch for marinades."
      }
    ]
  },
  "worcestershire_sauce": {
    "name": "Worcestershire Sauce",
    "category": "condiments",
    "aliases": [
      "Worcester sauce"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "complex fermented umami, anchovy-based depth, essential for Bloody Marys and steak"
    },
    "substitutions": [
      {
        "name": "Soy Sauce + Apple Cider Vinegar",
        "ratio": "1 tablespoon soy sauce + 1 teaspoon apple cider vinegar + pinch sugar = 1 tablespoon Worcestershire",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Approximates the soy-vinegar-sweet balance of Worcestershire.",
        "notes": "Missing fermented anchovy depth but provides similar seasoning function."
      },
      {
        "name": "Coconut Aminos + Vinegar",
        "ratio": "1 tablespoon coconut aminos + 1 teaspoon balsamic vinegar = 1 tablespoon Worcestershire",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides umami and tang. Vegetarian option.",
        "notes": "Different flavor profile but similar function. Good for vegan cooking."
      },
      {
        "name": "Tamarind Paste + Soy Sauce",
        "ratio": "1/2 tsp tamarind paste + 1 tbsp soy sauce + splash vinegar = 1 tbsp Worcestershire",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Tamarind adds the tangy-sweet depth that's key to Worcestershire.",
        "notes": "Closer to authentic flavor. Tamarind provides similar fermented complexity."
      }
    ]
  },
  "tahini": {
    "name": "Tahini",
    "category": "condiments",
    "aliases": [
      "sesame paste",
      "sesame seed butter"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "nutty richness, base for hummus and halva, Middle Eastern essential"
    },
    "substitutions": [
      {
        "name": "Sunflower Seed Butter",
        "ratio": "1 cup sunflower seed butter = 1 cup tahini",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Similar consistency and neutral-nutty flavor. Nut-free alternative.",
        "notes": "Very similar texture. Slightly different flavor but works well. Seed allergy-friendly.",
        "science": "<p>Tahini is ground sesame seeds, about 50% fat and rich in lignans (sesamin, sesamolin) that give it distinctive flavor. It's been used for thousands of years in Middle Eastern cuisine.</p><p>Sunflower seed butter has similar fat content and texture when ground smooth. The flavor is more neutral—it lacks sesame's distinctive nutty bitterness.</p><p>A good nut-free option that works in hummus and dressings.</p>"
      },
      {
        "name": "Cashew Butter",
        "ratio": "1 cup cashew butter = 1 cup tahini",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar smooth, rich texture. Milder flavor than tahini.",
        "notes": "Works well in hummus and dressings. Contains tree nuts.",
        "science": "<p>Cashews create a smooth, creamy butter when ground. They're lower in fat than sesame seeds (44% vs 50%) but emulsify similarly.</p><p>The flavor is much milder and sweeter than tahini's distinctive taste. Works well when you want the texture without strong sesame flavor.</p><p>Contains tree nuts, unlike tahini (sesame is a seed).</p>"
      },
      {
        "name": "Peanut Butter (smooth, unsweetened)",
        "ratio": "1 cup natural peanut butter = 1 cup tahini",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar consistency. Different, more assertive flavor.",
        "notes": "Will taste like peanut butter, not sesame. Works in some Asian sauces.",
        "science": "<p>Peanut butter has similar consistency to tahini but a very different, more assertive flavor. The fat content is comparable (about 50%).</p><p>In Asian sauces where sesame and peanut are often used together, peanut butter can work. For traditional Middle Eastern dishes, the flavor difference is significant.</p>"
      },
      {
        "name": "Greek Yogurt (for creaminess)",
        "ratio": "1/2 cup Greek yogurt = 1/4 cup tahini (for dressings/sauces)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides creamy texture without nut/seed flavor.",
        "notes": "Missing nutty flavor entirely. Use when you need creaminess, not tahini taste.",
        "science": "<p>Greek yogurt provides creaminess and body in dressings and sauces, but without any nutty or seed-based flavor.</p><p>Use this only when tahini's function is purely textural—providing smooth, creamy consistency. All the characteristic sesame flavor will be absent.</p><p>Good for lightening calorie content.</p>"
      }
    ]
  },
  "sesame_oil": {
    "name": "Sesame Oil (Toasted)",
    "category": "fats",
    "aliases": [
      "dark sesame oil",
      "Asian sesame oil"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "intense nutty flavor, finishing oil, essential for Asian cuisines"
    },
    "substitutions": [
      {
        "name": "Tahini + Neutral Oil",
        "ratio": "1/2 teaspoon tahini + 1.5 teaspoons neutral oil = 2 teaspoons sesame oil",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Tahini is ground sesame seeds. Provides sesame flavor in oil form.",
        "notes": "Won't be as intensely flavored. Use for dressings and drizzling."
      },
      {
        "name": "Perilla Oil",
        "ratio": "1 teaspoon perilla oil = 1 teaspoon sesame oil",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Korean oil with similar nutty, aromatic quality.",
        "notes": "Different flavor - more herbal/minty. Traditional in Korean cuisine."
      },
      {
        "name": "Walnut Oil",
        "ratio": "1 teaspoon walnut oil = 1 teaspoon sesame oil",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Another nutty finishing oil with strong flavor.",
        "notes": "Different flavor profile but provides similar nutty richness. Don't heat."
      },
      {
        "name": "Peanut Oil",
        "ratio": "1 teaspoon peanut oil = 1 teaspoon sesame oil (for cooking, not flavor)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Works for cooking but won't provide sesame flavor.",
        "notes": "Only for cooking, not as finishing oil. Missing distinctive sesame taste."
      }
    ]
  },
  "sake": {
    "name": "Sake",
    "category": "alcohol",
    "aliases": [
      "cooking sake",
      "Japanese rice wine",
      "nihonshu"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "tenderizes proteins, removes fishy odors, adds umami depth, enhances flavors"
    },
    "substitutions": [
      {
        "name": "Dry Sherry",
        "ratio": "1 tablespoon dry sherry = 1 tablespoon sake",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Similar alcohol content and flavor profile - slightly nutty and dry.",
        "notes": "The most commonly recommended sake substitute in Western cooking."
      },
      {
        "name": "Dry White Wine",
        "ratio": "1 tablespoon dry white wine = 1 tablespoon sake",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Provides the alcohol for tenderizing and deglazing.",
        "notes": "Flavor is different - more acidic. Use dry varieties like Sauvignon Blanc."
      },
      {
        "name": "Rice Vinegar + Water",
        "ratio": "1 tablespoon rice vinegar + 1/2 tablespoon water = 1.5 tablespoons sake (non-alcoholic)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides some of the rice-based flavor notes without alcohol.",
        "notes": "More acidic than sake. Reduce other acids in recipe. Missing tenderizing effect."
      },
      {
        "name": "Chicken or Vegetable Broth",
        "ratio": "1 tablespoon broth + pinch of sugar = 1 tablespoon sake (non-alcoholic)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides liquid and some savory depth without alcohol.",
        "notes": "Won't have same flavor but works for moisture in recipes."
      }
    ]
  },
  "rice_vinegar": {
    "name": "Rice Vinegar",
    "category": "acids",
    "aliases": [
      "rice wine vinegar",
      "seasoned rice vinegar"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "mild acidity, subtle sweetness, essential for sushi rice and Asian dressings"
    },
    "substitutions": [
      {
        "name": "Apple Cider Vinegar (diluted)",
        "ratio": "1 tablespoon apple cider vinegar + 1/4 teaspoon sugar + 1/2 tablespoon water = 1.5 tablespoons rice vinegar",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Apple cider vinegar is mild like rice vinegar. Diluting and sweetening gets it closer.",
        "notes": "Has a fruitier taste. Good for dressings and marinades."
      },
      {
        "name": "White Wine Vinegar (diluted)",
        "ratio": "1 tablespoon white wine vinegar + 1/4 teaspoon sugar + 1 teaspoon water = 1.5 tablespoons rice vinegar",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar mild acidity when diluted. Sugar balances the sharpness.",
        "notes": "Slightly more acidic flavor but works well in most recipes."
      },
      {
        "name": "Lemon or Lime Juice",
        "ratio": "1/2 tablespoon citrus juice + 1/2 tablespoon water = 1 tablespoon rice vinegar",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides acidity with a fresh, bright note.",
        "notes": "Different flavor profile - more citrusy. Fine for quick pickles and dressings."
      },
      {
        "name": "Champagne Vinegar",
        "ratio": "1 tablespoon champagne vinegar = 1 tablespoon rice vinegar",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar mild, slightly sweet acidity profile.",
        "notes": "More expensive but closest in delicacy to rice vinegar."
      }
    ]
  },
  "red_wine": {
    "name": "Red Wine (for cooking)",
    "category": "alcohol",
    "aliases": [
      "cooking wine",
      "dry red wine"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "deglazing, depth of flavor, acidity, tannins for richness"
    },
    "substitutions": [
      {
        "name": "Beef or Vegetable Broth + Vinegar",
        "ratio": "1 cup broth + 1 tablespoon red wine vinegar = 1 cup red wine",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Broth provides depth, vinegar adds acidity. Non-alcoholic option.",
        "notes": "Missing wine's complexity but provides similar cooking function."
      },
      {
        "name": "Grape Juice + Vinegar",
        "ratio": "3/4 cup grape juice + 2 tablespoons red wine vinegar = 1 cup red wine",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Grape juice is from the same fruit. Vinegar adds acidity.",
        "notes": "Sweeter than wine - may need to reduce other sugars. Good for deglazing."
      },
      {
        "name": "Pomegranate Juice",
        "ratio": "1 cup pomegranate juice = 1 cup red wine",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar color and tannin-like depth. Good acidity.",
        "notes": "Sweeter and fruitier than wine. Works well in Middle Eastern-inspired dishes."
      },
      {
        "name": "Cranberry Juice",
        "ratio": "1 cup cranberry juice = 1 cup red wine",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides color, acidity, and slight tannin quality.",
        "notes": "More tart than wine. Good for poultry and pork dishes."
      }
    ]
  },
  "white_wine": {
    "name": "White Wine (for cooking)",
    "category": "alcohol",
    "aliases": [
      "cooking wine",
      "dry white wine"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "deglazing, brightening sauces, acidity without color"
    },
    "substitutions": [
      {
        "name": "Chicken or Vegetable Broth + Lemon",
        "ratio": "1 cup broth + 1 tablespoon lemon juice = 1 cup white wine",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Broth provides savory depth, lemon adds acidity. Non-alcoholic.",
        "notes": "Good for deglazing and pan sauces. Missing wine's complexity."
      },
      {
        "name": "White Wine Vinegar + Water",
        "ratio": "1/4 cup white wine vinegar + 3/4 cup water = 1 cup white wine",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "White wine vinegar is literally oxidized white wine. Diluting reduces harshness.",
        "notes": "More acidic than wine. Good for quick cooking, not long braises."
      },
      {
        "name": "Apple Juice + Vinegar",
        "ratio": "3/4 cup apple juice + 2 tablespoons white wine vinegar = 1 cup white wine",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Apple provides subtle fruit notes, vinegar adds acidity.",
        "notes": "Sweeter than wine. Works for pork and chicken dishes."
      },
      {
        "name": "Dry Vermouth",
        "ratio": "1 cup dry vermouth = 1 cup white wine",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Vermouth is fortified wine with herbs. Excellent for cooking.",
        "notes": "Keeps longer than wine once opened. Adds herbal complexity."
      }
    ]
  },
  "gelatin": {
    "name": "Gelatin",
    "category": "thickeners",
    "aliases": [
      "unflavored gelatin",
      "Knox gelatin"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "function": "gelling agent, stabilizer for mousses, essential for panna cotta and jellies"
    },
    "substitutions": [
      {
        "name": "Agar Agar",
        "ratio": "1 teaspoon agar powder = 1 teaspoon gelatin (or 1 tablespoon agar flakes)",
        "reliability": "good",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Seaweed-based gelling agent. Vegan alternative to animal gelatin.",
        "notes": "Sets firmer and at room temperature (gelatin needs refrigeration). Must be boiled to activate. Doesn't melt in mouth the same way.",
        "science": "<p>Gelatin is derived from animal collagen—proteins that form triple helix structures, creating a thermoreversible gel that melts when heated and re-sets when cooled. This is why gelatin desserts melt in your mouth.</p><p>Agar comes from seaweed and contains agarose polysaccharides. It forms a different gel structure that's heat-stable: sets at 85-95°F and doesn't melt until 185°F.</p><p>Agar desserts hold up at room temperature but don't have gelatin's melt-in-mouth quality. Agar must be boiled to activate.</p>"
      },
      {
        "name": "Carrageenan",
        "ratio": "1 teaspoon carrageenan = 1 teaspoon gelatin",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Another seaweed-derived gelling agent. Used commercially in dairy products.",
        "notes": "Creates softer gel than agar. Vegan option. Less commonly available.",
        "science": "<p>Carrageenan is another seaweed-derived gelling agent, used commercially in dairy products and plant milks. It creates softer gels than agar.</p><p>The gel is vegan and sets at room temperature. It's less commonly available to home cooks but works well when found.</p>"
      },
      {
        "name": "Pectin",
        "ratio": "Varies by product - follow package directions",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Plant-based gelling agent from fruit. Requires acid and sugar to set.",
        "notes": "Only works with acidic, sugary preparations (jams, jellies). Not for savory applications.",
        "science": "<p>Pectin is a plant-based gelling agent from fruit (especially apples and citrus). Unlike gelatin, it requires acid and sugar to gel properly.</p><p>This makes it suitable only for sweet, acidic preparations like jams and jellies. It won't work for savory gelatin applications.</p>"
      },
      {
        "name": "Cornstarch (for thickening, not gelling)",
        "ratio": "2 tablespoons cornstarch = 1 tablespoon gelatin",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Thickens but doesn't create true gel. Works when you need thickness not jiggle.",
        "notes": "Not a true gel - more like thick sauce. Use for puddings where solid gel isn't needed.",
        "science": "<p>Cornstarch thickens by starch gelatinization, creating viscosity rather than a true gel. The result doesn't hold its shape like gelatin.</p><p>Use cornstarch for puddings and pie fillings where you want thickness but not a set gel. It can't make panna cotta or marshmallows.</p>"
      }
    ]
  },
  "pectin": {
    "name": "Pectin",
    "category": "thickeners",
    "aliases": [
      "fruit pectin",
      "Sure-Jell"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "gelling agent for jams and jellies, requires acid and sugar to set"
    },
    "substitutions": [
      {
        "name": "High-Pectin Fruit (apple, citrus)",
        "ratio": "Add 1 grated apple or lemon zest + juice per 4 cups low-pectin fruit",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Some fruits are naturally high in pectin. Adding them helps low-pectin fruits gel.",
        "notes": "Old-fashioned method. Green apples and citrus pith are highest in pectin. Requires longer cooking."
      },
      {
        "name": "Chia Seeds",
        "ratio": "1 tablespoon chia seeds per cup of fruit, let sit 30 min",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Chia seeds create gel-like consistency. Creates 'chia jam' without cooking.",
        "notes": "Different texture - visible seeds. Quick method. Less sweet since no cooking down."
      },
      {
        "name": "Gelatin (for refrigerator jam)",
        "ratio": "1 teaspoon gelatin per cup of fruit",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates gel, but requires refrigeration (won't be shelf-stable).",
        "notes": "Not for traditional canning - only refrigerator jam. Sets firmly when cold. Not vegan."
      },
      {
        "name": "Cornstarch (for fruit sauces)",
        "ratio": "1 tablespoon cornstarch per cup of fruit",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Thickens fruit but creates sauce, not true jam.",
        "notes": "Good for pie fillings and fruit sauces. Not for preserving or true jam texture."
      }
    ]
  },
  "xanthan_gum": {
    "name": "Xanthan Gum",
    "category": "thickeners",
    "aliases": [
      "xanthan"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "function": "gluten substitute in GF baking, thickener, emulsifier, creates elasticity"
    },
    "substitutions": [
      {
        "name": "Psyllium Husk Powder",
        "ratio": "2 teaspoons psyllium husk = 1 teaspoon xanthan gum",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Creates similar binding and elasticity in gluten-free baking.",
        "notes": "May need more liquid in recipe. Creates good texture in GF breads."
      },
      {
        "name": "Chia Seeds (ground) + Water",
        "ratio": "1 tablespoon ground chia + 2 tablespoons water = 1 teaspoon xanthan gum",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Chia gel provides binding similar to xanthan gum.",
        "notes": "Let sit until gelled. May add visible specks. Good for GF baking."
      },
      {
        "name": "Flax Meal + Water",
        "ratio": "1 tablespoon flax meal + 2 tablespoons water = 1 teaspoon xanthan gum",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Flax gel provides binding for gluten-free baking.",
        "notes": "Adds slight nutty flavor. Good for hearty GF breads."
      },
      {
        "name": "Guar Gum",
        "ratio": "1.5 teaspoons guar gum = 1 teaspoon xanthan gum",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Another plant-based gum with similar thickening properties.",
        "notes": "Works slightly differently - may need to adjust. Good for cold applications. Less elastic."
      },
      {
        "name": "Cornstarch (for thickening only)",
        "ratio": "1 tablespoon cornstarch = 1/4 teaspoon xanthan gum (for sauces)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both thicken, but cornstarch doesn't provide elasticity or binding.",
        "notes": "Only for thickening sauces, not for GF baking structure."
      }
    ]
  },
  "guar_gum": {
    "name": "Guar Gum",
    "category": "thickeners",
    "aliases": [
      "guaran"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "function": "thickening, stabilizing, works in cold applications, gluten-free baking"
    },
    "substitutions": [
      {
        "name": "Xanthan Gum",
        "ratio": "3/4 teaspoon xanthan gum = 1 teaspoon guar gum",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Similar gum with thickening properties. Xanthan is stronger.",
        "notes": "Xanthan provides more elasticity. Good swap for GF baking."
      },
      {
        "name": "Cornstarch (for thickening)",
        "ratio": "3 tablespoons cornstarch = 1 teaspoon guar gum",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both thicken liquids, though cornstarch requires heat.",
        "notes": "Cornstarch must be heated. Use for sauces, not cold applications."
      },
      {
        "name": "Arrowroot",
        "ratio": "3 tablespoons arrowroot = 1 teaspoon guar gum",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Natural thickener with neutral flavor.",
        "notes": "Requires heating. Good for sauces and gravies."
      }
    ]
  },
  "almond_flour": {
    "name": "Almond Flour",
    "category": "flour",
    "aliases": [
      "almond meal",
      "ground almonds"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "protein": "21%",
      "function": "gluten-free flour, adds moisture and richness, nutty flavor"
    },
    "substitutions": [
      {
        "name": "Oat Flour",
        "ratio": "1 cup oat flour = 1 cup almond flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar texture when ground fine. Lower fat, more neutral flavor.",
        "notes": "Not nut-free if cross-contamination is a concern. Slightly drier results."
      },
      {
        "name": "Sunflower Seed Flour",
        "ratio": "1 cup sunflower seed flour = 1 cup almond flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar fat content and texture. Nut-free alternative.",
        "notes": "May turn green in baked goods due to chlorophyll reacting with baking soda - add 1 tsp lemon juice to prevent."
      },
      {
        "name": "Coconut Flour (use less)",
        "ratio": "1/4 cup coconut flour = 1 cup almond flour (add 1 extra egg)",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Coconut flour is VERY absorbent. Requires major recipe adjustment.",
        "notes": "Very different texture. Add extra eggs and liquid. Results will be denser and more coconut-flavored."
      },
      {
        "name": "Cashew Flour",
        "ratio": "1 cup cashew flour = 1 cup almond flour",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Very similar fat content, texture, and behavior. Another tree nut.",
        "notes": "Milder, slightly sweeter flavor than almond. Works 1:1 in most recipes."
      },
      {
        "name": "All-Purpose Flour (non-GF)",
        "ratio": "1 cup AP flour = 1 cup almond flour (reduce fat, add liquid)",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Different properties entirely - has gluten, less fat, less protein.",
        "notes": "NOT gluten-free. Reduce butter/oil by 2 tbsp, may need less liquid. Texture will be very different."
      }
    ]
  },
  "coconut_flour": {
    "name": "Coconut Flour",
    "category": "flour",
    "aliases": [
      "coconut powder"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "fiber": "39%",
      "function": "highly absorbent gluten-free flour, requires extra eggs and liquid"
    },
    "substitutions": [
      {
        "name": "Almond Flour",
        "ratio": "1 cup almond flour = 1/4 cup coconut flour (remove 1 egg)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Almond flour is much less absorbent. Need 4x as much and fewer eggs.",
        "notes": "Reduce eggs by 1 for every 1/4 cup coconut flour replaced. Different texture - less dense."
      },
      {
        "name": "Cassava Flour",
        "ratio": "1 cup cassava flour = 1/4 cup coconut flour",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Both are grain-free. Cassava is less absorbent and more neutral.",
        "notes": "Adjust liquid - cassava needs much less. Good for those avoiding nuts."
      }
    ]
  },
  "oat_flour": {
    "name": "Oat Flour",
    "category": "flour",
    "aliases": [
      "ground oats"
    ],
    "context": [
      "baking"
    ],
    "properties": {
      "protein": "13%",
      "function": "tender crumb, slightly sweet flavor, can be made at home"
    },
    "substitutions": [
      {
        "name": "Homemade: Blend Rolled Oats",
        "ratio": "1 1/4 cups rolled oats blended = 1 cup oat flour",
        "reliability": "excellent",
        "context": [
          "baking"
        ],
        "why": "Oat flour IS just ground oats. Blend until powdery.",
        "notes": "Use certified GF oats if needed. Blend 30-60 seconds until fine powder."
      },
      {
        "name": "All-Purpose Flour",
        "ratio": "1 cup AP flour = 1 cup oat flour",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar protein content. AP flour has gluten, oat flour doesn't.",
        "notes": "NOT gluten-free. Results will be less tender with more structure."
      },
      {
        "name": "Whole Wheat Flour",
        "ratio": "1 cup whole wheat flour = 1 cup oat flour",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Similar whole-grain heartiness. Whole wheat has gluten.",
        "notes": "Denser results. May need slightly more liquid. NOT gluten-free."
      }
    ]
  },
  "parmesan": {
    "name": "Parmesan Cheese",
    "category": "cheese",
    "aliases": [
      "Parmigiano-Reggiano",
      "parm"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "aging": "12-36 months",
      "function": "intense umami, salty, nutty flavor, melts into sauces"
    },
    "substitutions": [
      {
        "name": "Pecorino Romano",
        "ratio": "1 cup Pecorino = 1 cup Parmesan",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Both are aged Italian hard cheeses with intense umami. Pecorino is sheep's milk.",
        "notes": "Pecorino is saltier and sharper. Use slightly less or reduce salt in recipe.",
        "science": "<p>Both Parmesan and Pecorino develop intense umami through extended aging. Proteins break down into free amino acids, including glutamate—the molecule responsible for umami taste.</p><p>Parmesan (cow's milk, aged 12-36 months) has about 1.2g glutamate per 100g. Pecorino (sheep's milk, aged 8-12 months) is saltier with different fatty acids.</p><p>Sheep's milk fats give Pecorino a sharper, more pungent flavor. Use slightly less and reduce added salt.</p>"
      },
      {
        "name": "Grana Padano",
        "ratio": "1 cup Grana Padano = 1 cup Parmesan",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Same style cheese, just aged less and from a different region. Very similar.",
        "notes": "Milder and less complex than true Parmigiano-Reggiano. More affordable.",
        "science": "<p>Grana Padano is essentially Parmesan's cousin—same style of hard Italian cheese made from cow's milk. The difference is aging time (9-20 months vs 12-36) and region.</p><p>Less aging means fewer amino acids from protein breakdown, resulting in milder, less complex flavor. It's also more affordable.</p><p>The texture and melting properties are very similar.</p>"
      },
      {
        "name": "Asiago (aged)",
        "ratio": "1 cup aged Asiago = 1 cup Parmesan",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Aged Asiago has similar hard texture and nutty, sharp flavor.",
        "notes": "Must be aged Asiago (stravecchio), not fresh. Similar umami quality.",
        "science": "<p>Aged Asiago (stravecchio) is a hard, granular cheese that develops similar nutty, sharp flavors through protein breakdown during aging.</p><p>It has comparable umami from glutamate development, though the specific flavor profile differs from Parmesan.</p><p>Make sure to use aged Asiago, not fresh Asiago, which is soft and mild.</p>"
      },
      {
        "name": "Nutritional Yeast (vegan)",
        "ratio": "3 tablespoons nutritional yeast + pinch salt = 1/4 cup grated Parmesan",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Nutritional yeast has natural glutamates (umami) and cheesy flavor.",
        "notes": "Won't melt like cheese. Good for sprinkling on pasta, popcorn. Add to sauces.",
        "science": "<p>Nutritional yeast (deactivated Saccharomyces cerevisiae) contains naturally occurring glutamic acid, providing its \"cheesy\" taste.</p><p>The yeast is grown on molasses, harvested, and heated to deactivate. While it provides umami, it lacks the aged cheese compounds—tyrosine crystals, lipase-produced fatty acids—that give Parmesan depth.</p><p>Won't melt like cheese. Good for sprinkling.</p>"
      },
      {
        "name": "Cotija (Mexican)",
        "ratio": "1 cup Cotija = 1 cup Parmesan",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Aged, salty, crumbly cheese with umami. 'Mexican Parmesan.'",
        "notes": "Different flavor profile - less nutty, more tangy. Works for sprinkling.",
        "science": "<p>Cotija is an aged Mexican cheese sometimes called \"Mexican Parmesan\" for its salty, crumbly character. It develops umami through aging.</p><p>The flavor profile differs—more tangy and less nutty than Parmesan. It's traditionally used as a finishing cheese, crumbled over dishes.</p><p>Good for tacos, elote, and grain bowls.</p>"
      }
    ]
  },
  "ricotta": {
    "name": "Ricotta Cheese",
    "category": "cheese",
    "aliases": [
      "ricotta"
    ],
    "context": [
      "baking",
      "cooking"
    ],
    "properties": {
      "fat": "10-13%",
      "function": "creamy texture, mild flavor, essential for lasagna and cannoli"
    },
    "substitutions": [
      {
        "name": "Cottage Cheese (blended)",
        "ratio": "1 cup blended cottage cheese = 1 cup ricotta",
        "reliability": "excellent",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Very similar texture when blended smooth. Same mild, milky flavor.",
        "notes": "Blend until completely smooth for ricotta-like texture. Slightly tangier."
      },
      {
        "name": "Cream Cheese + Yogurt",
        "ratio": "3/4 cup cream cheese + 1/4 cup plain yogurt, blended = 1 cup ricotta",
        "reliability": "good",
        "context": [
          "baking",
          "cooking"
        ],
        "why": "Creates similar creamy texture. Richer than ricotta.",
        "notes": "Blend until smooth. Results will be denser and richer."
      },
      {
        "name": "Mascarpone",
        "ratio": "1 cup mascarpone = 1 cup ricotta (for sweet dishes)",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Similar Italian fresh cheese. Much richer and creamier.",
        "notes": "Higher fat - better for desserts than savory. Works in cannoli, cheesecakes."
      },
      {
        "name": "Silken Tofu (blended)",
        "ratio": "1 cup blended silken tofu + 1 tbsp lemon juice = 1 cup ricotta",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar texture when blended. Vegan option.",
        "notes": "Add salt and lemon for flavor. Works well in lasagna and stuffed shells."
      },
      {
        "name": "Greek Yogurt (drained)",
        "ratio": "1 cup strained Greek yogurt = 1 cup ricotta",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar creamy texture. More tangy than ricotta.",
        "notes": "Strain through cheesecloth for thicker texture. Works for dips and lighter dishes."
      }
    ]
  },
  "feta": {
    "name": "Feta Cheese",
    "category": "cheese",
    "aliases": [
      "Greek feta"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "fat": "21%",
      "function": "tangy, salty, crumbly cheese for salads and Mediterranean dishes"
    },
    "substitutions": [
      {
        "name": "Goat Cheese (chèvre)",
        "ratio": "1 cup crumbled goat cheese = 1 cup feta",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Similar tangy flavor profile. Both are common in Mediterranean cooking.",
        "notes": "Goat cheese is creamier and less salty. Add pinch of salt if needed."
      },
      {
        "name": "Cotija",
        "ratio": "1 cup crumbled Cotija = 1 cup feta",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar salty, crumbly texture. Mexican cheese with comparable function.",
        "notes": "Less tangy than feta. Good for tacos, salads, grain bowls."
      },
      {
        "name": "Ricotta Salata",
        "ratio": "1 cup ricotta salata = 1 cup feta",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Pressed, salted ricotta with similar crumbly texture.",
        "notes": "Milder and less tangy. Good for salads and pasta."
      },
      {
        "name": "Halloumi (different texture)",
        "ratio": "1 cup cubed halloumi = 1 cup feta",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Another brined Mediterranean cheese. Doesn't crumble - holds shape.",
        "notes": "Won't crumble - cuts into cubes. Best grilled or pan-fried. Squeaky texture."
      },
      {
        "name": "Firm Tofu + Lemon + Salt (vegan)",
        "ratio": "1 cup cubed firm tofu marinated in lemon juice + salt + olive oil",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Tofu absorbs the tangy, salty brine flavors. Vegan feta.",
        "notes": "Press tofu first. Marinate 30+ min. Add herbs like oregano for authenticity."
      }
    ]
  },
  "cheddar": {
    "name": "Cheddar Cheese",
    "category": "cheese",
    "aliases": [
      "sharp cheddar",
      "mild cheddar"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "fat": "33%",
      "function": "melts smoothly, sharp tangy flavor, versatile cooking cheese"
    },
    "substitutions": [
      {
        "name": "Colby",
        "ratio": "1 cup Colby = 1 cup cheddar",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar cheese - milder, moister version of cheddar.",
        "notes": "Milder flavor. Melts slightly differently (more smoothly)."
      },
      {
        "name": "Gruyère",
        "ratio": "1 cup Gruyère = 1 cup cheddar",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both melt beautifully. Gruyère is nuttier and more complex.",
        "notes": "More expensive. Excellent for mac and cheese, fondue, gratins."
      },
      {
        "name": "Gouda",
        "ratio": "1 cup Gouda = 1 cup cheddar",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar melting properties. Slightly sweeter, less sharp.",
        "notes": "Aged Gouda is closer to sharp cheddar. Young Gouda is milder."
      },
      {
        "name": "Monterey Jack",
        "ratio": "1 cup Monterey Jack = 1 cup cheddar",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar texture and melting. Much milder flavor.",
        "notes": "Good for quesadillas, nachos. Pepper Jack adds heat."
      },
      {
        "name": "American Cheese",
        "ratio": "1 cup American = 1 cup cheddar (for melting only)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Designed for smooth melting. Much milder, processed.",
        "notes": "Only for melting applications (grilled cheese, burgers). Less complex flavor."
      }
    ]
  },
  "chicken_broth": {
    "name": "Chicken Broth",
    "category": "broth",
    "aliases": [
      "chicken stock",
      "chicken bouillon"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "adds savory depth, liquid base for soups, sauces, cooking grains"
    },
    "substitutions": [
      {
        "name": "Vegetable Broth",
        "ratio": "1 cup vegetable broth = 1 cup chicken broth",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Provides savory liquid base. Vegetarian/vegan option.",
        "notes": "Lighter flavor. Add a splash of soy sauce for more depth."
      },
      {
        "name": "Beef Broth",
        "ratio": "1 cup beef broth = 1 cup chicken broth",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both are meat broths with umami depth.",
        "notes": "Stronger, darker flavor. Better for hearty dishes than delicate ones."
      },
      {
        "name": "Bouillon Cube + Water",
        "ratio": "1 bouillon cube + 1 cup water = 1 cup broth",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Concentrated broth in cube form. Same flavor profile.",
        "notes": "Can be salty - taste before adding more salt. Good pantry staple."
      },
      {
        "name": "Better Than Bouillon",
        "ratio": "1 teaspoon paste + 1 cup water = 1 cup broth",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Concentrated broth paste. Very close to real broth.",
        "notes": "Keeps in fridge for months. Adjust amount to taste. Excellent quality."
      },
      {
        "name": "Water + Soy Sauce + Aromatics",
        "ratio": "1 cup water + 1 tsp soy sauce + garlic/ginger = 1 cup light broth",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates simple savory liquid when no broth available.",
        "notes": "Not as rich but works in a pinch. Add bay leaf or herbs if available."
      }
    ]
  },
  "vegetable_broth": {
    "name": "Vegetable Broth",
    "category": "broth",
    "aliases": [
      "vegetable stock",
      "veggie broth"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "vegetarian/vegan savory base, lighter than meat broths"
    },
    "substitutions": [
      {
        "name": "Chicken Broth (not vegetarian)",
        "ratio": "1 cup chicken broth = 1 cup vegetable broth",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "More savory depth. Not vegetarian.",
        "notes": "Richer flavor. Use when vegetarian isn't required."
      },
      {
        "name": "Mushroom Broth",
        "ratio": "1 cup mushroom broth = 1 cup vegetable broth",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Deep umami from mushrooms. Vegetarian/vegan.",
        "notes": "More intense flavor. Excellent for risotto, gravies, Asian dishes."
      },
      {
        "name": "Water + Miso",
        "ratio": "1 cup water + 1 tablespoon white miso = 1 cup broth",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Miso provides umami and fermented depth. Vegan.",
        "notes": "Add miso at end of cooking (don't boil). Different but delicious flavor."
      },
      {
        "name": "Homemade: Veggie Scraps",
        "ratio": "Simmer onion, carrot, celery scraps in water 30-60 min",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Real vegetable broth from scraps. Zero waste, great flavor.",
        "notes": "Save scraps in freezer until you have enough. Avoid brassicas (cabbage, broccoli) - they get bitter."
      }
    ]
  },
  "tomato_paste": {
    "name": "Tomato Paste",
    "category": "pantry",
    "aliases": [
      "tomato concentrate"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "concentration": "6x regular tomatoes",
      "function": "concentrated umami, deepens sauces, adds body without liquid"
    },
    "substitutions": [
      {
        "name": "Tomato Sauce (reduced)",
        "ratio": "3 tablespoons tomato sauce, simmered to reduce = 1 tablespoon tomato paste",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Tomato paste is just concentrated tomato sauce.",
        "notes": "Simmer sauce until reduced by 2/3. Takes 10-15 minutes."
      },
      {
        "name": "Canned Crushed Tomatoes (reduced)",
        "ratio": "1/2 cup crushed tomatoes, simmered to reduce = 2 tablespoons paste",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Same tomato base, just needs concentration through cooking.",
        "notes": "Strain seeds if desired. Simmer until thick."
      },
      {
        "name": "Ketchup (in a pinch)",
        "ratio": "1 tablespoon ketchup = 1 tablespoon tomato paste (reduce sugar/vinegar)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Contains tomato concentrate plus sugar and vinegar.",
        "notes": "Will add sweetness. Reduce other sugars in recipe. Only for emergencies."
      },
      {
        "name": "Sun-Dried Tomatoes (blended)",
        "ratio": "2 tablespoons sun-dried tomatoes blended with 1 tbsp water = 1 tablespoon paste",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Concentrated tomato flavor in dried form.",
        "notes": "Use oil-packed and drain, or rehydrate dried ones. More intense flavor."
      }
    ]
  },
  "dijon_mustard": {
    "name": "Dijon Mustard",
    "category": "condiments",
    "aliases": [
      "French mustard"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "smooth, sharp, emulsifies dressings, essential for vinaigrettes"
    },
    "substitutions": [
      {
        "name": "Whole Grain Mustard",
        "ratio": "1 tablespoon whole grain = 1 tablespoon Dijon",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Same mustard base, just with visible seeds. Similar heat level.",
        "notes": "Texture is different - grainy vs smooth. Flavor is very similar.",
        "science": "<p>Both Dijon and whole grain mustard use brown or black mustard seeds containing sinigrin. When seeds are crushed and mixed with liquid, the enzyme myrosinase converts sinigrin to allyl isothiocyanate—the compound creating mustard's heat.</p><p>Dijon is ground completely smooth; whole grain keeps visible seeds. The chemistry and heat level are essentially identical.</p><p>The texture differs significantly—whole grain adds visual interest and crunch.</p>"
      },
      {
        "name": "Yellow Mustard",
        "ratio": "1 tablespoon yellow mustard + pinch of horseradish = 1 tablespoon Dijon",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Yellow mustard is milder and sweeter. Horseradish adds Dijon's bite.",
        "notes": "More tangy and less complex. Works for dressings and sandwiches.",
        "science": "<p>Yellow mustard uses white/yellow mustard seeds containing sinalbin, a different compound that produces milder, more tongue-tingling heat than brown mustard's sinus-clearing burn.</p><p>It also contains more vinegar and added turmeric (for yellow color). The flavor is tangier and milder overall.</p><p>Adding horseradish brings some of the nasal heat that yellow mustard lacks.</p>"
      },
      {
        "name": "Spicy Brown Mustard",
        "ratio": "1 tablespoon spicy brown = 1 tablespoon Dijon",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar heat level and coarse texture. American deli style.",
        "notes": "Slightly different flavor profile but good substitute.",
        "science": "<p>Spicy brown mustard uses a blend of brown and yellow mustard seeds, creating heat between yellow and Dijon.</p><p>The texture is coarser than Dijon with visible seed fragments. Popular in American deli cuisine, it provides good pungency.</p>"
      },
      {
        "name": "Wasabi or Horseradish",
        "ratio": "1/2 teaspoon wasabi or horseradish = 1 tablespoon Dijon (for heat only)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides similar sharp, sinus-clearing heat.",
        "notes": "Only for the heat element - missing mustard flavor. Use in small amounts.",
        "science": "<p>Wasabi and horseradish create their heat through the same chemistry as mustard—glucosinolates converted to isothiocyanates by enzymes when cells are crushed.</p><p>The specific compounds differ, but the sinus-clearing sensation is similar. These provide heat only—none of mustard's complexity.</p><p>Use sparingly—these are much more concentrated.</p>"
      },
      {
        "name": "Mayonnaise (for emulsification only)",
        "ratio": "1 tablespoon mayo = 1 tablespoon Dijon (for dressings)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both emulsify dressings. Mayo lacks mustard flavor.",
        "notes": "Won't have mustard taste but will create creamy dressing. Add vinegar for tang.",
        "science": "<p>Mustard is an excellent emulsifier because of mucilage compounds that help oil and water mix. Mayonnaise is already emulsified and can serve this function in dressings.</p><p>You lose all mustard flavor but maintain creamy consistency. Add vinegar for acidity.</p>"
      }
    ]
  },
  "balsamic_vinegar": {
    "name": "Balsamic Vinegar",
    "category": "acids",
    "aliases": [
      "balsamic",
      "aceto balsamico"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "sweet-tart complexity, aged grape flavor, dressings and reductions"
    },
    "substitutions": [
      {
        "name": "Red Wine Vinegar + Honey",
        "ratio": "1 tablespoon red wine vinegar + 1/2 teaspoon honey = 1 tablespoon balsamic",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Red wine vinegar provides acidity, honey adds the sweetness balsamic has.",
        "notes": "Missing the aged complexity but provides similar sweet-tart balance.",
        "science": "<p>True balsamic vinegar is grape must (pressed juice) cooked down and aged in wooden barrels for years, developing complex flavors through oxidation and wood extraction.</p><p>Red wine vinegar provides a grape-based acid, while honey adds the missing sweetness. This approximates the sweet-tart balance but lacks aged complexity.</p><p>Works well in dressings where balsamic isn't the star ingredient.</p>"
      },
      {
        "name": "Sherry Vinegar",
        "ratio": "1 tablespoon sherry vinegar = 1 tablespoon balsamic",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Also an aged, complex vinegar with similar depth.",
        "notes": "Different flavor profile - nuttier. Less sweet than balsamic.",
        "science": "<p>Sherry vinegar is made from sherry wine using the solera system, where vinegars of different ages blend together. Extended oxidation creates nutty, complex flavors.</p><p>It has comparable depth to balsamic, though the specific flavor profile is more Spanish than Italian. Less sweet than balsamic.</p><p>An excellent substitute for those who appreciate aged vinegars.</p>"
      },
      {
        "name": "Apple Cider Vinegar + Molasses",
        "ratio": "1 tablespoon ACV + 1/2 teaspoon molasses = 1 tablespoon balsamic",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates dark color and sweet-tart balance.",
        "notes": "Different flavor but works in dressings and marinades.",
        "science": "<p>This combination creates the dark color and sweet-tart balance of balsamic. ACV provides fruity acidity; molasses adds color and caramelized sweetness.</p><p>The flavor is quite different—more fruity-earthy than balsamic's grape depth. Works in marinades and dressings.</p>"
      },
      {
        "name": "Chinese Black Vinegar",
        "ratio": "1 tablespoon black vinegar = 1 tablespoon balsamic",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar dark color and complex, slightly sweet flavor.",
        "notes": "Different taste - more malty. Good for fusion cooking.",
        "science": "<p>Chinese black vinegar (Chinkiang) is made from glutinous rice and wheat, aged to develop malty, complex flavors. It's less sweet than balsamic with more savory depth.</p><p>The dark color and complexity make it an interesting substitute. Flavor leans more Asian than Italian.</p><p>Try it in fusion dishes where either would work.</p>"
      }
    ]
  },
  "apple_cider_vinegar": {
    "name": "Apple Cider Vinegar",
    "category": "acids",
    "aliases": [
      "ACV",
      "cider vinegar"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "fruity mild acidity, health uses, baking, dressings"
    },
    "substitutions": [
      {
        "name": "White Wine Vinegar",
        "ratio": "1 tablespoon white wine vinegar = 1 tablespoon ACV",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Similar mild acidity level. Slightly less fruity.",
        "notes": "Very good substitute. Clean, mild flavor."
      },
      {
        "name": "Rice Vinegar",
        "ratio": "1 tablespoon rice vinegar = 1 tablespoon ACV",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Both are mild vinegars. Rice vinegar is slightly sweeter.",
        "notes": "Excellent substitute, especially for Asian-fusion dishes."
      },
      {
        "name": "Lemon Juice",
        "ratio": "1 tablespoon lemon juice = 1 tablespoon ACV",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both are mild acids. Lemon is more citrusy.",
        "notes": "Adds citrus flavor instead of apple. Good for dressings."
      },
      {
        "name": "Champagne Vinegar",
        "ratio": "1 tablespoon champagne vinegar = 1 tablespoon ACV",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar mild, delicate acidity.",
        "notes": "More expensive but excellent quality substitute."
      }
    ]
  },
  "fresh_herbs": {
    "name": "Fresh Herbs",
    "category": "herbs",
    "aliases": [
      "fresh basil",
      "fresh thyme",
      "fresh rosemary",
      "fresh parsley"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "bright flavor, aromatic oils, garnishing, finishing dishes"
    },
    "substitutions": [
      {
        "name": "Dried Herbs",
        "ratio": "1 teaspoon dried = 1 tablespoon fresh (3:1 ratio)",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Dried herbs are concentrated - water has evaporated, oils remain.",
        "notes": "Add dried herbs early in cooking (they need time to rehydrate). Fresh herbs add at end."
      },
      {
        "name": "Frozen Herbs",
        "ratio": "1 tablespoon frozen = 1 tablespoon fresh",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Frozen herbs retain most of their fresh flavor.",
        "notes": "Won't work for garnishing (texture changes). Great for cooking."
      },
      {
        "name": "Herb Paste (in tubes)",
        "ratio": "1 teaspoon paste = 1 tablespoon fresh",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Concentrated fresh herb flavor in convenient form.",
        "notes": "Gourmet Garden and similar brands. Good flavor, long fridge life."
      }
    ]
  },
  "dried_herbs": {
    "name": "Dried Herbs",
    "category": "herbs",
    "aliases": [
      "dried basil",
      "dried thyme",
      "dried oregano"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "concentrated flavor, long shelf life, add early in cooking"
    },
    "substitutions": [
      {
        "name": "Fresh Herbs",
        "ratio": "1 tablespoon fresh = 1 teaspoon dried (3:1 ratio)",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Fresh herbs have more volume but same essential oils when you use more.",
        "notes": "Add fresh herbs at end of cooking. Much brighter flavor."
      },
      {
        "name": "Different Dried Herb (similar flavor family)",
        "ratio": "Substitute within flavor families",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Some herbs have similar flavor profiles.",
        "notes": "Oregano ↔ Marjoram. Thyme ↔ Savory. Basil ↔ Oregano (Italian). Cilantro → Parsley (no swap for cilantro flavor)."
      }
    ]
  },
  "fresh_garlic": {
    "name": "Fresh Garlic",
    "category": "aromatics",
    "aliases": [
      "garlic cloves",
      "whole garlic"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "pungent aromatic base, essential for most cuisines"
    },
    "substitutions": [
      {
        "name": "Garlic Powder",
        "ratio": "1/8 teaspoon garlic powder = 1 clove fresh garlic",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Concentrated dehydrated garlic. Milder, less sharp than fresh.",
        "notes": "Won't brown like fresh garlic. Good for dry rubs, some sauces.",
        "science": "<p>When garlic is crushed, the enzyme alliinase converts alliin into allicin—the compound responsible for fresh garlic's pungent smell and sharp taste. Allicin is what you smell when you mince garlic.</p><p>Drying garlic denatures this enzyme, so garlic powder produces much less allicin. The flavor is milder and more mellow, without the raw bite.</p><p>Heat also destroys alliinase, which is why cooked garlic is sweet and mild.</p>"
      },
      {
        "name": "Granulated Garlic",
        "ratio": "1/4 teaspoon granulated = 1 clove fresh",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Coarser than powder. Similar conversion.",
        "notes": "Better texture for rubs and coatings than fine powder.",
        "science": "<p>Granulated garlic is the same as garlic powder but with larger particles. The flavor is identical—both are dehydrated garlic with denatured enzymes.</p><p>The coarser texture makes it better for dry rubs where you want to feel the garlic granules. It's also less likely to clump.</p>"
      },
      {
        "name": "Jarred Minced Garlic",
        "ratio": "1/2 teaspoon jarred = 1 clove fresh",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Pre-minced fresh garlic in oil or water.",
        "notes": "Milder than fresh. Convenient but less aromatic. Keep refrigerated.",
        "science": "<p>Jarred garlic is fresh garlic preserved in water, oil, or citric acid. Some allicin-producing capacity remains, but it diminishes over time.</p><p>The preserving liquid often dilutes the flavor, requiring more. Citric acid can add slight sourness. The convenience is significant but flavor is notably milder.</p>"
      },
      {
        "name": "Garlic Paste",
        "ratio": "1/2 teaspoon paste = 1 clove fresh",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Concentrated garlic in paste form.",
        "notes": "Very smooth - good for dressings. Check for added salt.",
        "science": "<p>Garlic paste is finely ground fresh garlic, sometimes with oil and preservatives. It retains more allicin potential than dried garlic.</p><p>The smooth texture blends invisibly into sauces and dressings. Check labels for added salt, which affects how much you need.</p>"
      },
      {
        "name": "Roasted Garlic",
        "ratio": "2 cloves roasted = 1 clove fresh",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Roasting mellows garlic significantly. Need more for same impact.",
        "notes": "Sweet and mellow, not pungent. Different flavor profile - use when that's desired.",
        "science": "<p>Roasting garlic at 400°F for 40+ minutes causes Maillard reactions and caramelization, transforming harsh allicin into dozens of mellow, sweet, complex flavor compounds.</p><p>The texture becomes soft and spreadable, the taste sweet and nutty. You need 2-3 times as much because the aggressive pungent compounds have been transformed.</p><p>Roasted garlic is almost a different ingredient—use it when you want that specific sweet character.</p>"
      }
    ]
  },
  "fresh_ginger": {
    "name": "Fresh Ginger",
    "category": "aromatics",
    "aliases": [
      "ginger root",
      "gingerroot"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "function": "spicy-sweet warmth, essential for Asian cuisine and baking"
    },
    "substitutions": [
      {
        "name": "Ground Ginger",
        "ratio": "1/4 teaspoon ground = 1 tablespoon fresh grated",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Concentrated and dried. Good for baking, less so for stir-fries.",
        "notes": "Better for baked goods. Missing the brightness of fresh for Asian cooking.",
        "science": "<p>Fresh ginger contains gingerols—the compounds responsible for its spicy-hot flavor. When dried, gingerols convert to shogaols, which are actually more pungent but have different flavor notes.</p><p>Ground ginger works well in baking where its warming spice integrates with other flavors. It lacks the bright, fresh zing that fresh ginger provides in stir-fries.</p><p>Use 1/4 teaspoon ground per tablespoon fresh.</p>"
      },
      {
        "name": "Ginger Paste",
        "ratio": "1 tablespoon paste = 1 tablespoon fresh grated",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Pureed fresh ginger in convenient form.",
        "notes": "Very close to fresh. Great for curries and stir-fries. Keep refrigerated.",
        "science": "<p>Ginger paste is fresh ginger pureed, sometimes with preservatives. It retains the gingerols and bright flavor of fresh ginger.</p><p>The smooth texture blends easily into marinades and curries. It's one of the most convenient substitutes with minimal flavor compromise.</p><p>Keep refrigerated after opening.</p>"
      },
      {
        "name": "Crystallized Ginger (for baking)",
        "ratio": "3 tablespoons minced crystallized ginger = 1 tablespoon fresh (reduce sugar)",
        "reliability": "fair",
        "context": [
          "baking"
        ],
        "why": "Candied ginger has strong ginger flavor.",
        "notes": "Very sweet - reduce other sugars. Rinse off sugar coating if desired.",
        "science": "<p>Crystallized ginger is fresh ginger cooked in sugar syrup and dried. The gingerols remain but are moderated by intense sweetness.</p><p>Mincing and rinsing removes some sugar coating. It works in baked goods where ginger is a prominent flavor, adding chewy bits.</p><p>Reduce other sugars in the recipe significantly.</p>"
      },
      {
        "name": "Galangal",
        "ratio": "1 tablespoon galangal = 1 tablespoon ginger",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Related root with similar spicy quality. Thai ginger.",
        "notes": "Different flavor - more piney/citrusy. Authentic for Thai food, not a direct swap.",
        "science": "<p>Galangal is a related rhizome used extensively in Thai and Indonesian cooking. It contains different essential oils, giving it a piney, citrusy flavor distinct from ginger.</p><p>While both provide aromatic heat, they're not interchangeable flavor-wise. Use galangal when a recipe calls for it specifically, or for Thai dishes where it's traditional.</p>"
      }
    ]
  },
  "gochujang": {
    "name": "Gochujang",
    "category": "asian",
    "aliases": [
      "Korean red pepper paste",
      "Korean chili paste"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "fermented sweet-spicy-umami paste, essential for Korean cooking"
    },
    "substitutions": [
      {
        "name": "Sriracha + Miso + Honey",
        "ratio": "1 tbsp sriracha + 1 tsp white miso + 1 tsp honey = ~2 tbsp gochujang",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Combines heat, fermented flavor, and sweetness that define gochujang.",
        "notes": "Not exact but captures the flavor profile. Adjust ratios to taste.",
        "science": "<p>Gochujang's unique flavor comes from fermenting gochugaru (Korean chili flakes) with meju (fermented soybean blocks), glutinous rice, and salt for months or years.</p><p>This substitute approximates the flavor profile: sriracha provides chili heat and garlic, miso contributes fermented soybean depth, and honey adds characteristic sweetness.</p><p>The fermented complexity won't be identical, but the flavor balance is close.</p>"
      },
      {
        "name": "Sambal Oelek + Soy Sauce + Sugar",
        "ratio": "1 tbsp sambal + 1 tsp soy sauce + 1 tsp brown sugar = ~2 tbsp gochujang",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Sambal provides chili heat, soy and sugar add depth and sweetness.",
        "notes": "Missing the fermented complexity. Works in a pinch.",
        "science": "<p>Sambal oelek provides pure chili heat with some garlic. Soy sauce adds fermented soybean umami (miso's liquid cousin). Sugar contributes sweetness.</p><p>This lacks the specific Korean chili flavor (gochugaru has a distinctive fruity sweetness) and the complex fermentation of true gochujang.</p><p>Works in a pinch for Korean-inspired dishes.</p>"
      },
      {
        "name": "Thai Chili Paste (nam prik pao)",
        "ratio": "1 tablespoon Thai chili paste = 1 tablespoon gochujang",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Also a sweet-spicy fermented chili paste.",
        "notes": "Different flavor profile (Thai vs Korean) but similar function.",
        "science": "<p>Thai chili paste is another fermented sweet-spicy condiment made from dried chilies, garlic, shrimp paste, and palm sugar.</p><p>The flavor profile is Thai rather than Korean—more fishy, tamarind-tangy, and with different chili varieties. The texture and use are similar.</p><p>Creates fusion rather than authentic Korean flavor.</p>"
      },
      {
        "name": "Tomato Paste + Cayenne + Soy + Honey",
        "ratio": "1 tbsp tomato paste + 1/4 tsp cayenne + 1 tsp soy sauce + 1 tsp honey",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates a paste with similar color, heat, and sweet-savory balance.",
        "notes": "Emergency substitute. Missing fermented depth but provides the general effect.",
        "science": "<p>This pantry-staple substitute creates a paste with similar color and sweet-spicy-savory balance. Tomato paste provides body and red color.</p><p>It completely lacks fermented depth—the most distinctive aspect of gochujang. Use when you need the general flavor profile and color, accepting it won't taste authentic.</p>"
      }
    ]
  },
  "shaoxing_wine": {
    "name": "Shaoxing Wine",
    "category": "asian",
    "aliases": [
      "Chinese cooking wine",
      "Shaoxing rice wine"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "essential for Chinese cooking, adds depth, removes gamey flavors"
    },
    "substitutions": [
      {
        "name": "Dry Sherry",
        "ratio": "1 tablespoon dry sherry = 1 tablespoon Shaoxing wine",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar nutty, complex flavor. The classic Western substitute.",
        "notes": "Best substitute available. Use dry (fino or amontillado), not sweet sherry."
      },
      {
        "name": "Sake",
        "ratio": "1 tablespoon sake = 1 tablespoon Shaoxing wine",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both are rice wines. Sake is cleaner, less complex.",
        "notes": "Add tiny pinch of sugar to approximate Shaoxing's slight sweetness."
      },
      {
        "name": "Mirin",
        "ratio": "1 tablespoon mirin = 1 tablespoon Shaoxing (reduce other sugars)",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Another Asian rice wine. Much sweeter than Shaoxing.",
        "notes": "Reduce or eliminate other sugars in recipe. Works for marinades."
      },
      {
        "name": "Dry White Wine",
        "ratio": "1 tablespoon dry white wine + pinch sugar = 1 tablespoon Shaoxing",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides alcohol for tenderizing, different flavor profile.",
        "notes": "Missing the nutty depth. Works in a pinch for stir-fries."
      },
      {
        "name": "Chicken Broth (non-alcoholic)",
        "ratio": "1 tablespoon broth + 1/2 tsp rice vinegar = 1 tablespoon Shaoxing",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides liquid and some depth without alcohol.",
        "notes": "Missing the alcohol's tenderizing effect and flavor. Emergency only."
      }
    ]
  },
  "sambal_oelek": {
    "name": "Sambal Oelek",
    "category": "asian",
    "aliases": [
      "sambal",
      "chili paste"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "pure chili heat with garlic, Indonesian condiment"
    },
    "substitutions": [
      {
        "name": "Sriracha",
        "ratio": "1 tablespoon sriracha = 1 tablespoon sambal oelek",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both are chili-garlic pastes. Sriracha is slightly sweeter and smoother.",
        "notes": "Sriracha has more sugar and vinegar. Works well in most applications."
      },
      {
        "name": "Gochugaru (Korean Chili Flakes) + Garlic",
        "ratio": "1 tbsp gochugaru + 1 tsp minced garlic + splash vinegar = 1 tbsp sambal",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Creates similar chunky chili-garlic paste.",
        "notes": "Gochugaru is milder - adjust amount for desired heat."
      },
      {
        "name": "Crushed Red Pepper + Garlic + Vinegar",
        "ratio": "1 tsp crushed red pepper + 1 tsp minced garlic + 1 tsp vinegar = ~1 tbsp sambal",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates basic chili-garlic paste from pantry staples.",
        "notes": "Different texture (dry vs wet). Let sit to meld flavors."
      },
      {
        "name": "Harissa",
        "ratio": "1 tablespoon harissa = 1 tablespoon sambal oelek",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both are chili pastes with garlic and spices.",
        "notes": "Different flavor profile (North African vs Indonesian). More cumin/coriander notes."
      }
    ]
  },
  "creme_fraiche": {
    "name": "Crème Fraîche",
    "category": "dairy",
    "aliases": [
      "creme fraiche",
      "French sour cream"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "fat": "30-40%",
      "function": "tangy, rich, won't curdle when heated, finishing sauces"
    },
    "substitutions": [
      {
        "name": "Sour Cream",
        "ratio": "1 cup sour cream = 1 cup crème fraîche",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Very similar cultured cream. Sour cream is tangier and lower fat.",
        "notes": "May curdle if boiled (crème fraîche won't). Add at end of cooking or temper first."
      },
      {
        "name": "Heavy Cream + Buttermilk (homemade)",
        "ratio": "1 cup heavy cream + 2 tbsp buttermilk, sit 24 hours at room temp",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "This IS how crème fraîche is made - cream cultured with bacteria.",
        "notes": "Cover loosely, leave at room temp 12-24 hours until thick. Refrigerate after."
      },
      {
        "name": "Greek Yogurt + Heavy Cream",
        "ratio": "1/2 cup Greek yogurt + 1/2 cup heavy cream = 1 cup crème fraîche",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Combines tang of yogurt with richness of cream.",
        "notes": "More tangy than true crème fraîche. Good for dolloping."
      },
      {
        "name": "Mascarpone + Lemon Juice",
        "ratio": "1 cup mascarpone + 1 tsp lemon juice = 1 cup crème fraîche",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Mascarpone has similar richness, lemon adds missing tang.",
        "notes": "Very rich. Good for desserts and finishing sauces."
      }
    ]
  },
  "peanut_butter": {
    "name": "Peanut Butter",
    "category": "nut_butters",
    "aliases": [
      "peanut paste",
      "PB"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "fat": "50%",
      "function": "creamy/crunchy spread, Asian sauces, baking"
    },
    "substitutions": [
      {
        "name": "Almond Butter",
        "ratio": "1 cup almond butter = 1 cup peanut butter",
        "reliability": "excellent",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Similar fat content and texture. Tree nut instead of legume.",
        "notes": "Milder flavor. Good for those with peanut (not tree nut) allergies."
      },
      {
        "name": "Cashew Butter",
        "ratio": "1 cup cashew butter = 1 cup peanut butter",
        "reliability": "excellent",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Very similar creamy texture. Mild, sweet flavor.",
        "notes": "Sweeter and milder than peanut butter. Excellent in Asian sauces."
      },
      {
        "name": "Sunflower Seed Butter",
        "ratio": "1 cup sunflower seed butter = 1 cup peanut butter",
        "reliability": "excellent",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Similar texture and fat content. Nut-free and peanut-free.",
        "notes": "May turn green when baked due to chlorophyll reaction - add 1 tsp lemon juice to batter."
      },
      {
        "name": "Tahini",
        "ratio": "1 cup tahini = 1 cup peanut butter",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar consistency. Sesame flavor instead of peanut.",
        "notes": "More bitter and savory. Works in Asian sauces, different in baking."
      },
      {
        "name": "Soy Nut Butter",
        "ratio": "1 cup soy nut butter = 1 cup peanut butter",
        "reliability": "good",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Made from roasted soybeans. Nut-free, similar texture.",
        "notes": "Closest to peanut butter in flavor. Good for allergies (check soy allergy)."
      }
    ]
  },
  "lemon_juice": {
    "name": "Lemon Juice",
    "category": "acids",
    "aliases": [
      "fresh lemon juice",
      "lemon"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "pH": "2.0-2.6",
      "function": "bright acidity, balances flavors, prevents browning, activates baking soda"
    },
    "substitutions": [
      {
        "name": "Lime Juice",
        "ratio": "1 tablespoon lime juice = 1 tablespoon lemon juice",
        "reliability": "excellent",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Nearly identical acidity level. Slightly different flavor.",
        "notes": "Works perfectly. Lime is slightly more bitter. Both are citrus acids.",
        "science": "<p>Lemon and lime juice have nearly identical acidity (pH 2.0-2.6) from citric acid. They're the closest substitutes for each other.</p><p>Lime has additional flavor compounds that make it slightly more bitter and less floral than lemon. In most cooking applications, they're interchangeable.</p><p>For lemon-forward dishes (like lemon bars), the flavor difference becomes noticeable.</p>"
      },
      {
        "name": "White Wine Vinegar",
        "ratio": "1/2 tablespoon white wine vinegar = 1 tablespoon lemon juice",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Provides acidity without citrus flavor.",
        "notes": "Use less - vinegar is more acidic. No citrus notes.",
        "science": "<p>Vinegar's acetic acid provides sourness like citric acid. White wine vinegar is relatively mild with some fruity complexity.</p><p>Use less vinegar since it's more acidic than lemon juice. You lose the citrus flavor entirely but maintain the acid function.</p><p>Good for dressings and marinades where acidity matters more than citrus taste.</p>"
      },
      {
        "name": "Apple Cider Vinegar",
        "ratio": "1/2 tablespoon ACV = 1 tablespoon lemon juice",
        "reliability": "good",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Mild vinegar that provides acidity.",
        "notes": "Adds fruity note. Works in baking for leavening activation.",
        "science": "<p>Apple cider vinegar has fruity notes that can partially compensate for missing citrus. The acidity is comparable when using slightly less.</p><p>ACV works particularly well in baking, where it can activate baking soda just like lemon juice. The apple notes are subtle in finished products.</p>"
      },
      {
        "name": "Orange Juice (less acidic)",
        "ratio": "2 tablespoons orange juice = 1 tablespoon lemon juice",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Another citrus juice, but sweeter and less acidic.",
        "notes": "Adds sweetness. Use when you want citrus but less tartness.",
        "science": "<p>Orange juice has lower acidity than lemon (pH around 3.5 vs 2.0). You need about twice as much for equivalent acid content.</p><p>The flavor is much sweeter and less tart. Use when you want citrus flavor without sharp acidity—in dressings, glazes, or marinades.</p>"
      },
      {
        "name": "Cream of Tartar (for baking)",
        "ratio": "1/2 teaspoon cream of tartar = 1 tablespoon lemon juice",
        "reliability": "good",
        "context": [
          "baking"
        ],
        "why": "Both are acids that activate baking soda.",
        "notes": "Only for leavening purposes - no citrus flavor.",
        "science": "<p>Cream of tartar (potassium bitartrate) is a dry acid that dissolves when liquids are added. It provides the same acid function as lemon juice for activating baking soda.</p><p>No citrus flavor—purely functional. Use 1/2 teaspoon cream of tartar per tablespoon lemon juice for leavening purposes.</p>"
      }
    ]
  },
  "anchovy_paste": {
    "name": "Anchovy Paste",
    "category": "pantry",
    "aliases": [
      "anchovy",
      "anchovies"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "intense umami, disappears into sauces, essential for Caesar dressing"
    },
    "substitutions": [
      {
        "name": "Fish Sauce",
        "ratio": "1/2 teaspoon fish sauce = 1 teaspoon anchovy paste",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Both are fermented fish products with intense umami.",
        "notes": "Fish sauce is liquid and saltier. Provides same savory depth."
      },
      {
        "name": "Worcestershire Sauce",
        "ratio": "1 teaspoon Worcestershire = 1 teaspoon anchovy paste",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Contains anchovies plus other fermented flavors.",
        "notes": "More complex flavor with tamarind and molasses. Less fishy."
      },
      {
        "name": "Miso Paste (vegetarian)",
        "ratio": "1 tablespoon white miso = 1 teaspoon anchovy paste",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides fermented umami depth without fish.",
        "notes": "Vegetarian option. Different flavor but similar savory function."
      },
      {
        "name": "Soy Sauce + Tiny Pinch of Seaweed",
        "ratio": "1 teaspoon soy sauce + pinch of nori flakes = 1 teaspoon anchovy paste",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Soy provides umami, seaweed adds ocean flavor.",
        "notes": "Vegetarian. Won't taste the same but adds similar depth."
      },
      {
        "name": "Capers (for brininess)",
        "ratio": "1 tablespoon minced capers = 1 teaspoon anchovy paste",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides briny, savory notes without fish.",
        "notes": "Different flavor - pickled vs fermented. Works for some applications."
      }
    ]
  },
  "capers": {
    "name": "Capers",
    "category": "pantry",
    "aliases": [
      "caper berries"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "briny, tangy bursts of flavor, Mediterranean dishes"
    },
    "substitutions": [
      {
        "name": "Green Olives (chopped)",
        "ratio": "1 tablespoon chopped green olives = 1 tablespoon capers",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar briny, Mediterranean flavor profile.",
        "notes": "Larger pieces - chop fine. Less tangy than capers."
      },
      {
        "name": "Pickled Pepperoncini (chopped)",
        "ratio": "1 tablespoon chopped pepperoncini = 1 tablespoon capers",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides similar briny, pickled bite.",
        "notes": "Adds mild heat. Different flavor but similar function."
      },
      {
        "name": "Dill Pickles (chopped fine)",
        "ratio": "1 tablespoon minced dill pickle = 1 tablespoon capers",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Briny, pickled, tangy - similar flavor notes.",
        "notes": "Dill flavor will come through. Works in tartar sauce, some salads."
      },
      {
        "name": "Lemon Zest + Salt (for brightness)",
        "ratio": "1 teaspoon lemon zest + pinch of salt = 1 tablespoon capers",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides similar bright, punchy accent.",
        "notes": "Won't have briny flavor but adds similar brightness to dishes."
      }
    ]
  },
  "nutritional_yeast": {
    "name": "Nutritional Yeast",
    "category": "vegan",
    "aliases": [
      "nooch",
      "savory yeast flakes"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "cheesy, nutty flavor for vegan dishes, B-vitamins"
    },
    "substitutions": [
      {
        "name": "Parmesan Cheese (not vegan)",
        "ratio": "1/4 cup grated Parmesan = 3 tablespoons nutritional yeast",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Both provide umami and cheesy flavor.",
        "notes": "Not vegan. Provides similar savory, cheesy depth."
      },
      {
        "name": "Miso Paste",
        "ratio": "1 tablespoon white miso = 2 tablespoons nutritional yeast",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both provide fermented umami depth.",
        "notes": "Different flavor - more savory than cheesy. Adds saltiness."
      },
      {
        "name": "Soy Sauce + Garlic Powder",
        "ratio": "1 tsp soy sauce + 1/2 tsp garlic powder = 1 tbsp nutritional yeast",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Creates savory umami flavor.",
        "notes": "Missing the B-vitamins and cheesy quality. Emergency substitute."
      },
      {
        "name": "Brewer's Yeast",
        "ratio": "1 tablespoon brewer's yeast = 1 tablespoon nutritional yeast",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar product from brewing industry.",
        "notes": "More bitter taste. Not as pleasant for most applications."
      }
    ]
  },
  "coconut_cream": {
    "name": "Coconut Cream",
    "category": "dairy",
    "aliases": [
      "cream of coconut"
    ],
    "context": [
      "cooking",
      "baking"
    ],
    "properties": {
      "fat": "24%+",
      "function": "thick, rich coconut product for curries, desserts, whipping"
    },
    "substitutions": [
      {
        "name": "Full-Fat Coconut Milk (chilled, solids only)",
        "ratio": "Refrigerate can overnight, scoop solid cream = coconut cream",
        "reliability": "excellent",
        "context": [
          "cooking",
          "baking"
        ],
        "why": "Coconut cream IS the thick part of coconut milk that separates.",
        "notes": "Chill can 24 hours. Scoop only the solid white cream, discard liquid."
      },
      {
        "name": "Heavy Cream (not vegan)",
        "ratio": "1 cup heavy cream = 1 cup coconut cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar fat content and richness.",
        "notes": "Not vegan. Won't have coconut flavor. Works for texture/richness."
      },
      {
        "name": "Cashew Cream",
        "ratio": "1 cup thick cashew cream = 1 cup coconut cream",
        "reliability": "good",
        "context": [
          "cooking"
        ],
        "why": "Similar thick, rich texture. Vegan.",
        "notes": "Blend soaked cashews with less water for thicker cream. Neutral flavor."
      }
    ]
  },
  "sriracha": {
    "name": "Sriracha",
    "category": "condiments",
    "aliases": [
      "rooster sauce",
      "hot chili sauce"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "garlicky heat with sweetness, versatile Asian-American hot sauce"
    },
    "substitutions": [
      {
        "name": "Sambal Oelek + Sugar",
        "ratio": "1 tbsp sambal oelek + 1/2 tsp sugar = 1 tbsp sriracha",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Sambal is similar chili-garlic base. Sugar adds sriracha's sweetness.",
        "notes": "Very close substitute. Same brand often makes both."
      },
      {
        "name": "Tabasco + Garlic + Sugar",
        "ratio": "1 tbsp Tabasco + pinch garlic powder + pinch sugar = 1 tbsp sriracha",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Approximates the heat, garlic, and sweetness.",
        "notes": "Much thinner consistency. Different heat profile (vinegar-forward)."
      },
      {
        "name": "Gochujang (diluted)",
        "ratio": "1 tbsp gochujang + 1 tsp water or vinegar = 1 tbsp sriracha",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Both are sweet-spicy Asian condiments.",
        "notes": "Different flavor profile - more fermented. Works for marinades."
      },
      {
        "name": "Cayenne + Garlic + Vinegar + Sugar",
        "ratio": "1/2 tsp cayenne + 1/4 tsp garlic powder + 1 tsp vinegar + 1/2 tsp sugar",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Builds sriracha flavor from basic ingredients.",
        "notes": "Mix together. Won't have same texture but captures the flavor."
      }
    ]
  },
  "black_pepper": {
    "name": "Black Pepper",
    "category": "spices",
    "aliases": [
      "pepper",
      "peppercorns"
    ],
    "context": [
      "cooking"
    ],
    "properties": {
      "function": "pungent heat different from chili, universal seasoning"
    },
    "substitutions": [
      {
        "name": "White Pepper",
        "ratio": "1 teaspoon white pepper = 1 teaspoon black pepper",
        "reliability": "excellent",
        "context": [
          "cooking"
        ],
        "why": "Same plant, just processed differently. Similar heat.",
        "notes": "Milder, more earthy. Used in light-colored dishes where black specks unwanted."
      },
      {
        "name": "Pink Peppercorns",
        "ratio": "1 teaspoon pink peppercorns = 1 teaspoon black pepper",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Similar pungent quality though technically different plant.",
        "notes": "Milder, slightly sweet. More decorative than functional."
      },
      {
        "name": "Ground Coriander",
        "ratio": "1/2 teaspoon coriander = 1 teaspoon black pepper",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides some warmth and complexity.",
        "notes": "Very different flavor - citrusy. Use when pepper is not essential."
      },
      {
        "name": "Paprika (for color) + Cayenne (for heat)",
        "ratio": "1/2 tsp paprika + tiny pinch cayenne = 1 tsp black pepper",
        "reliability": "fair",
        "context": [
          "cooking"
        ],
        "why": "Provides both color and heat element.",
        "notes": "Very different flavor. Only when black pepper unavailable."
      }
    ]
  }
}